{
    "quotes": [
        {
            "author": "Gandalf the Grey, The Council of Elrond",
            "quote": "'And he that breaks a thing to find out what it is has left the path of wisdom.'"
        },
        {
            "author": "Gandalf the Grey, The Council of Elrond",
            "quote": "'Even the most subtle spiders may leave a weak thread.'"
        },
        {
            "author": "Saruman the White, The Council of Elrond",
            "quote": "'The time of the Elves is over, but our time is at hand: the World of Men, which we must rule.'"
        },
        {
            "author": "Gandalf the White, The Voice of Saruman",
            "quote": "'Often does hatred hurt itself!'"
        },
        {
            "author": "Gandalf the White, The Palantír",
            "quote": "'Perilous to us, all are the devices of an art deeper than we possess ourselves.'"
        },
        {
            "author": "Gandalf the White, The Palantír",
            "quote": "'The burned hand teaches best. After that advice about fire goes to the heart.'"
        },
        {
            "author": "Gandalf, The Last Debate",
            "quote": "'...it is not our part to master all the tides of the world, but to do what is in us for the succour of those years wherein we are set...'"
        },
        {
            "author": "Gandalf the Grey, The Shadow of the Past",
            "quote": "'All we have to decide is what to do with the time that is given us.'"
        },
        {
            "author": "Gandalf to Frodo, Many Meetings",
            "quote": "'There are many powers in the world, for good or for evil. Some are greater than I am. Against some I have not yet been measured. But my time is coming.'"
        },
        {
            "author": "about the Witch-king, The Battle of the Pelennor Fields",
            "quote": "He now was destroyed; but Gothmog, the lieutenant of Morgul, had flung them into the fray; Easterlings with axes, and Variags of Khand."
        },
        {
            "author": "Aragorn about Gandalf, A Journey in the Dark",
            "quote": "'He is surer of finding the way home in a blind night than the cats of Queen Berúthiel.'"
        },
        {
            "author": "Gandalf, The Shadow of the Past",
            "quote": "'Many that live deserve death. Some that die deserve life. Can you give it to them, Frodo? Then do not be too eager to deal out death in judgment.'"
        },
        {
            "author": "Saruman's crime, Morgoth's Ring",
            "quote": "...the interbreeding of Orcs and Men, producing both Men-orcs large and cunning, and Orc-men treacherous and vile."
        },
        {
            "author": "about Sauron's fingers, The Black Gate is Closed",
            "quote": "'Yes, he has only four on the Black Hand, but they are enough' said Gollum shuddering."
        },
        {
            "author": "Gandalf the White to the hobbits, The Grey Havens",
            "quote": "'I will not say do not weep, for not all tears are an evil.'"
        },
        {
            "author": "Gandalf to the Balrog, The Bridge of Khazad-dûm",
            "quote": "'You cannot pass!... I am a servant of the Secret Fire, wielder of the Flame of Anor. The dark fire will not avail you, Flame of Udûn! Go back to the shadow. You cannot pass!'"
        },
        {
            "author": "The Lady about the Ring, The Mirror of Galadriel",
            "quote": "'Before you could use that power you would need to become far stronger, and to train your will to the domination of others.'"
        },
        {
            "author": "Aragorn about Sauron, The Passing of the Grey Company",
            "quote": "'He is not so mighty yet that he is above fear; nay, doubt ever gnaws him.'"
        },
        {
            "author": "Aragorn about Sauron, The Passing of the Grey Company",
            "quote": "'New in the very hour of his great designs the heir of Isildur and the Sword are revealed; for I showed the blade re-forged to him.'"
        },
        {
            "author": "Unfinished Tales; The Disaster of the Gladden Fields",
            "quote": "...for there were certain Woodmen who got news to Thranduil by runners, and also themselves gathered a force to ambush the Orcs..."
        },
        {
            "author": "Beregond, Citadel Guard, Minas Tirith",
            "quote": "'...we bear the brunt of the chief hatred of the Dark Lord, for the hatred comes down out of the depths of time and over the deeps of the Sea.'"
        },
        {
            "author": "Gandalf to Frodo, The Shadow of the Past",
            "quote": "'There was more than one power at work, Frodo. The Ring was trying to get back to its master.'"
        },
        {
            "author": "Gandalf, Of the Rings of Power and the Third Age",
            "quote": "'It is not needed that the Ring should be found, for while it abides on the Earth and is not unmade, still the power it holds will live, Sauron will grow and have hope.'"
        },
        {
            "author": "Unfinished Tales; The Hunt for the Ring",
            "quote": "Then Celebrimbor was put to torment, and Sauron learned from him where the Seven were bestowed."
        },
        {
            "author": "Gildor Inglorion of the House of Finrod, Three is Company",
            "quote": "'Seldom give unguarded advice, for advice is a dangerous gift, even from the wise to the wise, and all courses may run ill.'"
        },
        {
            "author": "Gildor Inglorion of the House of Finrod, Three is Company",
            "quote": "'Do not meddle with the affairs of Wizards for they are subtle and quick to anger.'"
        },
        {
            "author": "Elrond Lord of Rivendell, Many Meetings",
            "quote": "'It is perilous to study too deeply the arts of the Enemy, for good or for ill.'"
        },
        {
            "author": "Elrond about the Elven Rings, The Council of Elrond",
            "quote": "'Those who made them did not desire strength or domination or hoarded wealth, but understanding, making, and healing, to preserve all things unstained.'"
        },
        {
            "author": "The Lord of Rivendell, The Council of Elrond",
            "quote": "'Fruitless did I call the victory of the Last Alliance? Not wholly so, yet it did not achieve its end. Sauron was diminished, but not destroyed. His Ring was lost but not unmade.'"
        },
        {
            "author": "to Gandalf, The Council of Elrond",
            "quote": "'We were all at fault,' said Elrond, 'and but for your vigilance the Darkness, maybe, would already be upon us.'"
        },
        {
            "author": "The Lord of Rivendell, The Council of Elrond",
            "quote": "'We must take a hard road, a road unforeseen. There lies our hope, if hope it be. To walk into peril — to Mordor. We must send the Ring to the Fire.'"
        },
        {
            "author": "Elrond Lord of Rivendell, The Council of Elrond",
            "quote": "'Be comforted. For there are other powers and realms that you know not, and they are hidden from you.'"
        },
        {
            "author": "Gandalf about Sauron, The Last Debate",
            "quote": "'We must march out to meet him at once.'"
        },
        {
            "author": "The Lady of Lórien, The Mirror of Galadriel",
            "quote": "'You saw the Eye of him that holds the Seven and the Nine.'"
        },
        {
            "author": "Concerning Hobbits",
            "quote": "It is plain indeed that in spite of later estrangement, Hobbits are relatives of ours: far nearer to us than Elves, or even than Dwarves."
        },
        {
            "author": "Lord Elrond, The Rings Goes South",
            "quote": "'The Company of the Ring shall be Nine; and the Nine Walkers shall be set against the Nine Riders that are evil'"
        },
        {
            "author": "Unfinished Tales",
            "quote": "For Radagast, the fourth, became enamoured of the many beasts and birds that dwelt in Middle-earth, and forsook Elves and Men, and spent his days among the wild creatures."
        },
        {
            "author": "Glorfindel, The Council of Elrond",
            "quote": "'Yet oft in lies truth is hidden.'"
        },
        {
            "author": "Gimli son of Glóin, The Rings Goes South",
            "quote": "'Faithless is he that says farewell when the road darkens.'"
        },
        {
            "author": "Gimli son of Glóin, The Rings Goes South",
            "quote": "'Yet sworn word may strengthen quaking heart.'"
        },
        {
            "author": "Gimli son of Glóin, The Last Debate",
            "quote": "'It is ever so with the things that Men begin: there is a frost in Spring, or a blight in Summer, and they fail of their promise.'"
        },
        {
            "author": "Haldir the Marchwarden, Lothlórien",
            "quote": "'The world is indeed full of peril, and in it there are many dark places; but still there is much that is fair...'"
        },
        {
            "author": "The Blue Wizards, Unfinished Tales",
            "quote": "...whether they remained in the East, pursuing there the purposes for which they were sent; or perished; or as some hold were ensnared by Sauron... is not now known."
        },
        {
            "author": "Lord Celeborn, Farewell to Lórien",
            "quote": "'Do not despise the lore that has come down from distant years; for often it may chance that old wives keep in memory word of things that once were needful for the wise to know.'"
        },
        {
            "author": "Éomer, Third Marshal, Helm's Deep",
            "quote": "'I thank you, Gimli, son of Glóin... I did not know you where with us in the sortie. But oft the unbidden guest proves the best company.'"
        },
        {
            "author": "Éomer King of the Mark, The Battle of the Pelennor Fields",
            "quote": "'Hope often deceives... Yet twice blessed is help unlooked for.'"
        },
        {
            "author": "Éomer, Third Marshal, The Riders of Rohan",
            "quote": "'These are indeed strange days', he muttered. 'Dreams and legends spring to life out of the grass.'"
        },
        {
            "author": "Éomer, Third Marshal, The Riders of Rohan",
            "quote": "'So many strange things have chanced that to learn the praise of a fair lady under the loving strokes of a Dwarf's axe will seem no great wonder.'"
        },
        {
            "author": "Strider, A Knife in the Dark",
            "quote": "'...in the first days of the Northern Kingdom, they built a great watch-tower on Weathertop, Amon Sûl they called it.'"
        },
        {
            "author": "Aragorn, Captain of the Dúnedain, Helm's Deep",
            "quote": "'None knows what the new day shall bring him.'"
        },
        {
            "author": "The Passing of the Grey Company",
            "quote": "'The hasty stroke goes oft astray', said Aragorn."
        },
        {
            "author": "Aragorn, The Passing of the Grey Company",
            "quote": "'Yet deeds will not be less valiant because they are unpraised.'"
        },
        {
            "author": "Éothain, The Riders of Rohan",
            "quote": "'Do we walk in legends or on the green earth in the daylight?'"
        },
        {
            "author": "Aragorn, The Riders of Rohan",
            "quote": "'Good and ill have not changed since yesteryear.'"
        },
        {
            "author": "Aragorn, The Riders of Rohan",
            "quote": "'There are some things that it is better to begin than to refuse, even though the end may be dark.'"
        },
        {
            "author": "Aragorn, Flotsam and Jetsam",
            "quote": "'One who cannot cast away a treasure at need is in fetters.'"
        },
        {
            "author": "Strider",
            "quote": "'I am Aragorn, son of Arathorn; and if by life or death I can save you, I will.'"
        },
        {
            "author": "Aragorn, Strider",
            "quote": "'Gandalf is greater than you Shire-folk know — as a rule you can only see his jokes and toys. But this business of ours will be his greatest task.'"
        },
        {
            "author": "Aragorn, Flight to the Ford",
            "quote": "'There my heart is; but it is not my fate to sit in peace, even in the fair house of Elrond.'"
        },
        {
            "author": "Aragorn, The Council of Elrond",
            "quote": "'A new hour comes. Isildur's Bane is found. Battle is at hand. The Sword shall be reforged.'"
        },
        {
            "author": "Aragorn, The Riders of Rohan",
            "quote": "'Gondor! Gondor!... Would that I looked on you again in happier hour! Not yet does my road lie southward to your bright streams.'"
        },
        {
            "author": "Boromir, Captain-General, The Council of Elrond",
            "quote": "'Believe not that in the land of Gondor the blood of Númenor is spent, nor all its pride and dignity forgotten.'"
        },
        {
            "author": "Boromir of Gondor, The Council of Elrond",
            "quote": "'...and thus alone are peace and freedom maintained in the lands behind us, bulwark of the West.'"
        },
        {
            "author": "Boromir of Gondor, The Council of Elrond",
            "quote": "'It would comfort us to know that others fought also with all the means that they have.'"
        },
        {
            "author": "Damrod the Ranger about Southrons, Of Herbs and Stewed Rabbit",
            "quote": "'The road may pass but they shall not! Not while Faramir is Captain.'"
        },
        {
            "author": "Ranger of Ithilien about Mûmakil, Of Herbs and Stewed Rabbit",
            "quote": "'Ware! Ware!' cried Damrod to his companion. 'May the Valar turn him aside! Mûmak! Mûmak!'"
        },
        {
            "author": "The Battle of the Pelennor Fields",
            "quote": "Southward beyond the road lay the main force of the Haradrim, and there their horsemen were gathered."
        },
        {
            "author": "Haradrim's Chieftain, The Battle of the Pelennor Fields",
            "quote": "...displaying his standard, black serpent upon scarlet, he came..."
        },
        {
            "author": "Aragorn's travels, The Council of Elrond",
            "quote": "'...and trodden many plains, even into the far countries of Rhûn and Harad...'"
        },
        {
            "author": "Denethor II about the Palantír, The Pyre of Denethor",
            "quote": "'Didst thou think that the eyes of the White Tower were blind? Nay, I have seen...'"
        },
        {
            "author": "Denethor II with the Palantír, The Pyre of Denethor",
            "quote": "'But against the Power that now arises there is no victory.'"
        },
        {
            "author": "Faramir, Captain, Of Herbs and Stewed Rabbit",
            "quote": "'The praise of the praiseworthy is above all rewards.'"
        },
        {
            "author": "Sméagol, The Black Gate is Closed",
            "quote": "'Not nice; very cruel wicked Men they look. Almost as bad as Orcs, and much bigger.'"
        },
        {
            "author": "The Black Gate is Closed",
            "quote": "In it was a single gate of iron, and upon its battlement sentinels paced unceasingly."
        },
        {
            "author": "Faramir to Éowyn, The Steward and the King",
            "quote": "'I do not believe any darkness will endure!'"
        },
        {
            "author": "Sméagol to Frodo, The Black Gate is Closed",
            "quote": "'Don't take the Precious to Him! He'll eat us all, if He gets it, eat all the world.'"
        },
        {
            "author": "Boromir, The Fellowship of the Ring",
            "quote": "'One does not simply walk into Mordor.'"
        },
        {
            "author": "The Breaking of the Fellowship",
            "quote": "... out of the East Men were moving endlessly: swordsmen, spearmen, bowmen upon horses, chariots of chieftains and laden wains."
        },
        {
            "author": "At the Sign of The Prancing Pony",
            "quote": "Bree was the chief village of the Bree-land, a small inhabited region, like an island in the empty lands..."
        },
        {
            "author": "Many Meetings",
            "quote": "'Do you really mean that Strider is one of the people of the old Kings?' said Frodo in wonder."
        },
        {
            "author": "Frodo Baggins, The Scouring of the Shire",
            "quote": "'It is useless to meet revenge with revenge: it will heal nothing.'"
        },
        {
            "author": "Gollum about Sauron, The Black Gate is Closed",
            "quote": "'And He hated Isildur's city.'"
        },
        {
            "author": "to the Nazgûl, Flight to the Ford",
            "quote": "'By Elbereth and Lúthien the Fair,' said Frodo with a last effort, lifting up his sword, 'you shall have neither the Ring nor me!'"
        },
        {
            "author": "Frodo to Faramir on Isildur's Bane, The Window On The West",
            "quote": "'It does not belong to any mortal, great or small; though if any could claim it, it would be Aragorn, son of Arathorn.'"
        },
        {
            "author": "about Morgoth, Valaquenta",
            "quote": "Among those of his servants that have names the greatest was that spirit whom the Eldar called Sauron, or Gorthaur the Cruel."
        },
        {
            "author": "Samwise Gamgee, gardener, The Window On The West",
            "quote": "'Fair speech may hide a foul heart.'"
        },
        {
            "author": "Concerning Pipe-weed",
            "quote": "...it was from Bree that the art of smoking the genuine weed spread in the recent centuries among Dwarves and such other folk, Rangers, Wizards...'"
        },
        {
            "author": "Pippin to Denethor II, Minas Tirith",
            "quote": "'The mightiest man may be slain by one arrow', he said; 'and Boromir was pierced by many.'"
        },
        {
            "author": "Pippin, Minas Tirith",
            "quote": "'I'm no warrior at all and dislike any thought of battle; but waiting on the edge of one, I can't escape is worst of all.'"
        },
        {
            "author": "Quenta Silmarillion",
            "quote": "Then Morgoth hurled aloft Grond, the Hammer of the Underworld, and swung it down like a bolt of thunder."
        },
        {
            "author": "Bilbo to his guests, A Long-expected Party",
            "quote": "'I don't know half of you half as well as I should like; and I like less than half of you half as well as you deserve.'"
        },
        {
            "author": "words of Bilbo, Three is Company",
            "quote": "'It's a dangerous business, Frodo, going out your door... You step into the Road, and if you don't keep your feet, there's no knowing where you might be swept off to.'"
        },
        {
            "author": "The prince of the Woodland Realm, Lothlórien",
            "quote": "'There lie the woods of Lothlórien!' said Legolas. 'That is the fairest of all the dwellings of my people.'"
        },
        {
            "author": "Gimli at Dunharrow, The Passing of the Grey Company",
            "quote": "'Here is a thing unheard of!' he said. 'An Elf will go underground and a Dwarf dare not!'"
        },
        {
            "author": "Aragorn and the Grey Host, The Passing of the Grey Company",
            "quote": "'Oathbreakers, why have ye come? 'And a voice was heard out of the night that answered... 'To fulfil our oath and have peace.'"
        },
        {
            "author": "The Hobbit",
            "quote": "'Murderers and elf-friends!' the Great Goblin shouted. '... Take them away to dark holes full of snakes...'"
        },
        {
            "author": "Théoden to Aragorn, Helm's Deep",
            "quote": "'When dawn comes, I will bid men sound Helm's and I will ride forth.'"
        },
        {
            "author": "Goblins, The Hobbit",
            "quote": "'Grip, grab! Pinch, nab! And down down to Goblin-town! You go, my lad!'"
        },
        {
            "author": "a Rohirrim chant by Aragorn, The King of the Golden Hall",
            "quote": "'Where are now the horse and the rider? Where is the horn that was blowing?... They have passed like rain on the mountain, like wind in the meadow. The days have gone down in the West behind the hills into shadow.'"
        },
        {
            "author": "King Théoden, The Ride of the Rohirrim",
            "quote": "'Arise, arise, Riders of Théoden! Fell deeds awake; fire and slaughter! Spear shall be shaken, shield splintered, a sword-day, a red day, ere the sun rises! Ride now, ride now! Ride to Gondor!'"
        },
        {
            "author": "The Ring Goes South",
            "quote": "No living hobbit (save Bilbo) could remember the Fell Winter of 1311, when the white wolves invaded the Shire over the frozen Brandywine."
        },
        {
            "author": "The Taming of Sméagol",
            "quote": "'Where is it: my Precious, my Precious? It's ours, it is, and we wants it. The thieves... Curse them! We hates them.'"
        },
        {
            "author": "The Lady of Lórien, The Mirror of Galadriel",
            "quote": "'Your Quest stands upon the edge of a knife. Stray but a little, and it will fail, to the ruin of all. Yet hope remains while the Company is true.'"
        },
        {
            "author": "Aragorn's grandfather, Annals of the Kings and Rulers",
            "quote": "Arador was taken by hill-trolls in the Coldfells north of Rivendell and was slain..."
        },
        {
            "author": "The Peoples of Middle-earth",
            "quote": "Orcs and Trolls occupy parts of the now empty Mines of Moria."
        },
        {
            "author": "Boromir, Captain-General, The Great River",
            "quote": "'...we are all too tired - except, no doubt, our sturdy dwarf.' Gimli made no reply, he was nodding as he sat."
        },
        {
            "author": "Denethor about him and Faramir, The Siege of Gondor",
            "quote": "'No tomb! No long, slow sleep of death embalmed. We shall burn, like the heathen kings before ever a ship sailed hither from the West.'"
        },
        {
            "author": "Denethor II, Steward of Gondor, The Siege of Gondor",
            "quote": "'Why? Why do the fools fly?' said Denethor. 'Better to burn sooner than late, for burn we must... The West has failed. Go back and burn!'"
        },
        {
            "author": "Steward Denethor II, Minas Tirith",
            "quote": "'Fealty with love, valour with honour, oath-breaking with vengeance.'"
        },
        {
            "author": "The host, In the House of Tom Bombadil",
            "quote": "'Hey! Come Frodo, there! Where be you a-going? Old Tom Bombadil's not as blind as that yet. Take off your golden ring! Your hand's more fair without it.'"
        },
        {
            "author": "Minas Tirith, Of the Rings of Power and the Third Age",
            "quote": "...there the kings caused to be built in the citadel a white tower, very tall and fair, and its eye was upon many lands."
        },
        {
            "author": "Tom Bombadil, Fog on the Barrow-Downs",
            "quote": "'Old Tom Bombadil is a merry fellow, bright blue his jacket is, and his boots are yellow. None have ever caught him yet, for Tom, he is the master: His songs are stronger songs, and his feet are faster.'"
        },
        {
            "author": "The Lays of Beleriand",
            "quote": "...the Orcs went forth to rape and war, and Balrog captains marched before."
        },
        {
            "author": "Words scribed upon the One Ring in the language of Mordor",
            "quote": "Ash nazg durbatulûk, ash nazg gimbatul. Ash nazg thrakatulûk agh burzum-ishi krimpatul."
        },
        {
            "author": "Words scribed upon the One Ring in the Common tongue",
            "quote": "One Ring to rule them all. One Ring to find them. One Ring to bring them all and in the darkness bind them."
        },
        {
            "author": "Aragorn at the Argonath, The Great River",
            "quote": "'Fear not!' he said. 'Long have I desired to look upon the likenesses of Isildur and Anárion, my sires of old.'"
        },
        {
            "author": "Denethor II, Unfinished Tales",
            "quote": "...consult the Stone... trusting his strength. His trust was not entirely unjustified. Sauron failed to dominate him and could only influence him by deceits."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "That country had of old been named Lindon by the Ñoldor, and this name it bore thereafter; and many of the Eldar still dwelt there..."
        },
        {
            "author": "The Hobbit",
            "quote": "'We like the dark,' said the dwarves. 'Dark for dark business!'"
        },
        {
            "author": "Morgoth Bauglir, The Children of Húrin",
            "quote": "'I am the Elder King: Melkor, first and mightiest of the Valar, who was before the world, and made it.'"
        },
        {
            "author": "Smaug, The Hobbit",
            "quote": "'My armour is like tenfold shields, my teeth are swords, my claws spears, the shock of my tail a thunderbolt, my wings a hurricane, and my breath death!'"
        },
        {
            "author": "Smaug, The Hobbit",
            "quote": "'I laid low the warriors of old and their like is not in the world today.'"
        },
        {
            "author": "Dwarves fight Glaurung the Dragon, Quenta Silmarillion",
            "quote": "But the Naugrim made a circle about him when he assailed them, and even his mighty armour was not full proof against the blows of their great axes."
        },
        {
            "author": "Gandalf about Aragorn, Strider",
            "quote": "From the ashes, a fire shall be woken. A light from the shadow shall spring. Renewed shall be blade that was broken. The crownless again shall be king."
        },
        {
            "author": "The Battle of the Pelennor Fields",
            "quote": "But the Rohirrim sang no more. 'Death' they cried with one voice loud and terrible..."
        },
        {
            "author": "Fingon High King of the Ñoldor, Quenta Silmarillion",
            "quote": "'Utúlie'n aurë! Aiya Eldalië ar Atanatári, utúlie'n aurë! The day has come! Behold, people of the Eldar and Fathers of Men, the day has come!’"
        },
        {
            "author": "Yavanna about Dwarves and Ents, Quenta Silmarillion",
            "quote": "'Now let thy children beware! For there shall walk a power in the forests whose wrath they will arouse at their peril.'"
        },
        {
            "author": "Éomer, The Battle of the Pelennor Fields",
            "quote": "'Death! Ride, ride to ruin and the world's ending!'"
        },
        {
            "author": "Gandalf, The Council of Elrond",
            "quote": "'I was far from Isengard, ere the Wolves and Orcs issued from the gate to pursue me.'"
        },
        {
            "author": "Boromir, Captain-General, The Council of Elrond",
            "quote": "'The Men of Gondor are valiant, and they will never submit; but they may be beaten down.'"
        },
        {
            "author": "Gandalf, The Bridge of Khazad-dûm",
            "quote": "He staggered and fell, grasped vainly at the stone, and slid into the abyss. 'Fly, you fools!' he cried and was gone."
        },
        {
            "author": "The Battle of the Pelennor Fields",
            "quote": "...the Southrons were bold men and grim, and fierce in despair; and the Easterlings were strong and war-hardened and asked for no quarter."
        },
        {
            "author": "The Battle of the Pelennor Fields",
            "quote": "All were slain... and to the land of the Haradrim came only a tale from far off: a rumour of the wrath and terror of Gondor."
        },
        {
            "author": "the Ram Grond, The Siege of Gondor",
            "quote": "...its hideous head, founded of black steel, was shaped in the likeness of a ravening wolf; on it spells of ruin lay."
        },
        {
            "author": "The Book of Lost Tales Two; Fall of Gondolin",
            "quote": "There stood the house of the Golden Flower who bare a rayed sun upon their shield, and their chief Glorfindel..."
        },
        {
            "author": "'Axes of the Dwarves! The Dwarves are upon you!', Helm's Deep",
            "quote": "'Baruk Khazâd! Khazâd ai-mênu!'"
        },
        {
            "author": "Ainulindale",
            "quote": "When therefore Earth was yet young and full of flame Melkor coveted it, and he said to the other Valar: ‘This shall be my own kingdom; and I name it unto myself!’"
        },
        {
            "author": "Lord Elrond, The Hobbit",
            "quote": "'This, Gandalf, was Glamdring, Foe-hammer that the king of Gondolin once wore.'"
        },
        {
            "author": "Grima Wormtongue, The Hunt for the Ring",
            "quote": "...he hastened to bring word to Saruman that Gandalf was come to Edoras, and had warned King Théoden of the treacherous designs of Isengard."
        },
        {
            "author": "Sauron, The Hunt for the Ring",
            "quote": "At length he resolved that no others would serve him in this case but his mightiest servants, the Ringwraiths..."
        },
        {
            "author": "Quenta Silmarillion",
            "quote": "...in the tempering of steel alone of all crafts the Dwarves were never outmatched, even by the Ñoldor..."
        },
        {
            "author": "Quenta Silmarillion",
            "quote": "In all the deeds of Melkor the Morgoth upon Arda, in his vast works and in the deceits of his cunning, Sauron had a part, and was only less evil than his master in that for long he served another and not himself."
        },
        {
            "author": "Quenta Silmarillion",
            "quote": "But the Dwarves held on their way, and... there was battle in the Thousand Caves, and many Elves and Dwarves were slain; and it has not been forgotten."
        },
        {
            "author": "Quenta Silmarillion",
            "quote": "...Aulë made the Dwarves strong to endure. Therefore they are stone-hard, stubborn, fast in friendship and in enmity, and they suffer toil and hanger and hurt of body more hardily than all other speaking peoples."
        },
        {
            "author": "Quenta Silmarillion",
            "quote": "...Quendi who came into the hands of Melkor... breed the hideous race of the Orcs in envy and mockery of the Elves, of whom they were afterwards the bitterest foes."
        },
        {
            "author": "Quenta Silmarillion",
            "quote": "The lies that Melkor, the mighty and accursed, Morgoth Bauglir, the Power of Terror and of Hate, sowed in the hearts of Elves and Men are a seed that does not die and cannot be destroyed"
        },
        {
            "author": "Quenta Silmarillion",
            "quote": "Many are the songs that have been sung of the dual of Glorfindel and the Balrog upon the pinnacle of rock in that high place; and both fell into the abyss."
        },
        {
            "author": "Morgoth Bauglir, The Children of Húrin",
            "quote": "'The shadow of my purpose is upon Arda, and all that is in it bends slowly and surely to my will.'"
        },
        {
            "author": "about Dwarves, Quenta Silmarillion",
            "quote": "...and in the making of mail of linked rings, which was first contrived by the smiths of Belegost, their work had no rival."
        },
        {
            "author": "Quenta Silmarillion",
            "quote": "Sauron was become now a sorcerer of dreadful power, master of shadows and of phantoms, foul in wisdom, cruel in strength, misshaping what he touched..."
        },
        {
            "author": "about Dwarves, Quenta Silmarillion",
            "quote": "...it was their custom moreover to wear great masks in battle hideous to look upon; and those stood them in great stead against the dragons."
        },
        {
            "author": "The Battle of the Pelennor Fields",
            "quote": "and the drawing of the scimitars of the Southrons was like a glitter of stars."
        },
        {
            "author": "Queen Erendis of Númenor, Unfinished Tales",
            "quote": "'But if men weary of rest and the plays of peace, soon they will go back to their great play, manslaying and war.'"
        },
        {
            "author": "Pippin about Beregond, Minas Tirith",
            "quote": "...tall and proud and noble, as all the men that he had yet seen in that land; and with a glitter in his eye as he thought of the battle."
        },
        {
            "author": "Easterlings, Quenta Silmarillion",
            "quote": "The sons of Bór were Borlad, Borlach, and Borthand; and they followed Maedhros and Maglor, and cheated the hope of Morgoth, and were faithful."
        },
        {
            "author": "Gorbag about Sam, The Choices of Master Samwise",
            "quote": "'...there's someone loose hereabouts as is more dangerous than any other damned rebel that ever walked since the bad old times, since the Great Siege.'"
        },
        {
            "author": "Gorbag about Sam, The Choices of Master Samwise",
            "quote": "'By all the signs, Captain Shagrat, I'd say there's a large warrior loose, Elf most likely, with an elf-sword anyway, and an axe as well may be...'"
        },
        {
            "author": "Quenta Silmarillion",
            "quote": "A warlike race of old... they would fight fiercely against whomsoever aggrieved them: servants of Melkor, or Eldar, or Avari, or wild beasts, or not seldom their own kin, Dwarves of other mansions and lordships."
        },
        {
            "author": "Quenta Silmarillion",
            "quote": "Galadriel, the only woman of the Ñoldor to stand that day tall and valiant among the contending princess... yearned to see the wide unguarded lands and to rule there a realm at her own will."
        },
        {
            "author": "Quenta Silmarillion",
            "quote": "For the Orcs had life and multiplied after the manner of the Children of Ilúvatar..."
        },
        {
            "author": "Quenta Silmarillion",
            "quote": "And deep in their dark hearts, the Orcs loathed the Master whom they served in fear, the maker only of their misery."
        },
        {
            "author": "Quenta Silmarillion",
            "quote": "Now the Orcs that multiplied in the darkness of the earth grew strong and fell, and their dark lord filled them with a lust of ruin and death."
        },
        {
            "author": "Ñoldor return to Middle-earth, Quenta Silmarillion",
            "quote": "No tale has told what Morgoth thought in his heart at the tidings that Fëanor, his bitterest foe, had brought a host out of the West."
        },
        {
            "author": "Aragorn, The Passing of the Grey Company",
            "quote": "'We must press our Enemy, and no longer wait upon him for the move.'"
        },
        {
            "author": "about Galadriel, Quenta Silmarillion",
            "quote": "...she remained in the Hidden Kingdom, and abode with Melian, and of her learned great lore and wisdom concerning Middle-earth."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "...the Haradrim, a great and cruel people that dwelt in the wide lands south of Mordor beyond the mouths of Anduin."
        },
        {
            "author": "Quenta Silmarillion",
            "quote": "Thus, befell the contest of Sauron and Felagund which is renowned. For Felagund strove with Sauron in songs of power, and the power of the King was very great; but Sauron had the mastery..."
        },
        {
            "author": "Quenta Silmarillion",
            "quote": "...Lúthien wove two themes of words, of the sorrow of the Eldar and the grief of Men, of the Two Kindreds that were made by Ilúvatar to dwell in Arda..."
        },
        {
            "author": "Damrod, Ithilien ranger, about Southrons, Of Herbs and Stewed Rabbit",
            "quote": "'...they are gone over to Him, or back to Him - they were ever ready to His will - as have so many also in the East.'"
        },
        {
            "author": "Helm's Deep",
            "quote": "And then, sudden and terrible, the sound of the great horn of Helm rang out."
        },
        {
            "author": "Quenta Silmarillion",
            "quote": "The light of the drawing of the swords of the Ñoldor was like a fire in a field of reeds."
        },
        {
            "author": "Damrod, Ithilien ranger, Of Herbs and Stewed Rabbit",
            "quote": "'...the days of Gondor are numbered, and the walls of Minas Tirith are doomed, so great is His strength and malice.'"
        },
        {
            "author": "the fall of Nargothrond, Quenta Silmarillion",
            "quote": "The Orcs had slain or driven off all that remained in arms, and were even then ransacking the great halls and chambers, plundering and destroying."
        },
        {
            "author": "Sauron, Quenta Silmarillion",
            "quote": "His dominion was torment."
        },
        {
            "author": "Quenta Silmarillion",
            "quote": "...much is told in The Fall of Gondolin: of the battle of Ecthelion of the Fountain with Gothmog Lord of Balrogs in the very square of the King, where each slew the other..."
        },
        {
            "author": "Boromir of Gondor, The Council of Elrond",
            "quote": "'Valour needs first strength and then a weapon.'"
        },
        {
            "author": "Dwarves armed the Sindar, Quenta Silmarillion",
            "quote": "...Thingol took thought for arms, which before his people had not needed, and these at first the Naugrim smithied for him; for they were greatly skilled in such work."
        },
        {
            "author": "the Great Ram, The Siege of Gondor",
            "quote": "Grond they named it, in memory of the Hammer of the Underworld of old."
        },
        {
            "author": "Gorbag, Captain of Minas Morgul, The Choices of Master Samwise",
            "quote": "'As I said, the Big Bosses, ay,' his voice sank almost to a whisper, 'ay, even the Biggest, can make mistakes.'"
        },
        {
            "author": "Unfinished Tales; The Tradition of Isildur",
            "quote": "...Minas Ithil was in the hands of the Nazgûl, and Ithilien was desolate; but Gondor had not relinquished its claim to them."
        },
        {
            "author": "Quenta Silmarillion",
            "quote": "Many now fled to the Havens and took refuge behind Círdan's walls, and the mariners passed up and down the coast and harried the enemy with swift landings."
        },
        {
            "author": "Quenta Silmarillion",
            "quote": "...the first mariners in Middle-earth and the first makers of ships. Círdan the Shipwright was their lord."
        },
        {
            "author": "Unfinished Tales",
            "quote": "...the Oath of Eorl, and was answered by the Oath of Cirion, confirming for ever the alliance of the Kingdoms of the Rohirrim and of Gondor."
        },
        {
            "author": "Gandalf the Grey, Unfinished Tales",
            "quote": "'To resist any force that Sauron might send to regain the northern passes... there were only the Dwarves of the Iron Hills'"
        },
        {
            "author": "about Ñoldor, Quenta Silmarillion",
            "quote": "They are the Deep Elves, the friends of Aulë; and they are renowned in song, for they fought and laboured long and grievously in the northern lands of old."
        },
        {
            "author": "Dwarves attack Orcs, Quenta Silmarillion",
            "quote": "...and those that fled north from the great slaughter were waylaid by the axes of the Naugrim that issued from Mount Dolmed."
        },
        {
            "author": "Gandalf the White, Unfinished Tales",
            "quote": "'Dwarves understand devotion to friends and gratitude to those who help them.'"
        },
        {
            "author": "King Finrod Felagund, Quenta Silmarillion",
            "quote": "...he swore an oath of abiding friendship and aid in every need to Barahir and all his kin, and in token of his vow he gave to Barahir his ring."
        },
        {
            "author": "Bergil son of Beregond to Pippin, Minas Tirith",
            "quote": "'The Captains of the Outlands are expected up the South Road ere sundown. Come with us and you will see.'"
        },
        {
            "author": "Gandalf about Lórien and Rivendell, Unfinished Tales",
            "quote": "'And those places might have fallen, I think, if Sauron had thrown all his power against them first, and not spent more than half of it in the assault on Gondor.'"
        },
        {
            "author": "Gandalf about Hired Men, Unfinished Tales",
            "quote": "'For a reward they will go in where you dare not, or at any rate cannot, and get what you desire.'"
        },
        {
            "author": "Thorin Oakenshield about his quest, Unfinished Tales",
            "quote": "'For I am serious also. Deadly serious, and my heart is hot within me.'"
        },
        {
            "author": "the Hobbits, At the Sign of the Prancing Pony",
            "quote": "They lived mostly in Staddle though there were some in Bree itself, especially on the higher slopes of the hill, above the houses of the Men."
        },
        {
            "author": "Quenta Silmarillion",
            "quote": "And the inner fire of the Silmarils, Fëanor made of the blended light of the Trees of Valinor, which lives in them yet, though the Trees have long withered and shine no more."
        },
        {
            "author": "Quenta Silmarillion",
            "quote": "...out of the pits of Angband, there issued the winged dragons, that had not before been seen."
        },
        {
            "author": "Nandor ambush Dwarves, Quenta Silmarillion",
            "quote": "...for as they climbed up Gelion's banks... all the woods were filled with the sound of Elven-horns, and shafts sped upon them from every side."
        },
        {
            "author": "Sindar compared to High Elves, Quenta Silmarillion",
            "quote": "Only to the realm of Doriath, whose queen Melian was of the kindred of Valar, did the Sindar come near to match the Calaquendi of the Blessed Realm."
        },
        {
            "author": "Steward Denethor II, The Siege of Gondor",
            "quote": "'The West has failed.'"
        },
        {
            "author": "Gandalf the White, Unfinished Tales",
            "quote": "'A small oversight; but it proved fatal. Small oversights often do.'"
        },
        {
            "author": "Unfinished Tales; The Hunt for the Ring",
            "quote": "Thus, Sauron tested the strength and preparedness of Denethor, and found them more than he had hoped."
        },
        {
            "author": "The Doom of Mandos upon the Ñoldor, Quenta Silmarillion",
            "quote": "‘...ye shall dwell in Death’s shadow. For though Eru appointed to you to die not in Eä, and no sickness may assail you, yet slain ye may be, and slain ye shall be: by weapon and by torment...’"
        },
        {
            "author": "the first Dúnedain, Akallabêth",
            "quote": "Eönwë came among them and taught them; and they were given wisdom and power and life more enduring than any others of mortal race have possessed."
        },
        {
            "author": "about Sauron, Akallabêth - The Downfall of Númenor",
            "quote": "...he strove ever for the dominion of Middle-earth, to become a king over all kings and as a god unto Men."
        },
        {
            "author": "Akallabêth - The Downfall of Númenor",
            "quote": "This was the beginning of that people that in the Grey-Elven speech are called the Dúnedain: the Númenóreans, Kings among Men."
        },
        {
            "author": "the Dúnedain, Akallabêth - The Downfall of Númenor",
            "quote": "...their years were long. Therefore they grew wise and glorious... and they were tall, taller than the tallest of the sons of Middle-earth."
        },
        {
            "author": "the Witch-king, The Hunt for the Ring",
            "quote": "But the power of the White Ring he would not defy, nor enter yet into Lórien."
        },
        {
            "author": "Akallabêth - The Downfall of Númenor",
            "quote": "For the Dúnedain became mighty in crafts, so that if they had had the mind they could easily have surpassed the evil kings of Middle-earth in the making of war and the forging of weapons."
        },
        {
            "author": "the Dwarves lost Mount Gundabad, The Peoples of Middle-earth",
            "quote": "...its occupation in the Third Age by the Orcs of Sauron was one of the chief reasons for their great hatred of the Orcs."
        },
        {
            "author": "Gandalf about the Balrog, The White Rider",
            "quote": "'His fire was quenched, but now he was a thing of slime, stronger than a strangling snake.'"
        },
        {
            "author": "Unfinished Tales; The Hunt for the Ring",
            "quote": "The Circle of Isengard was too strong for even the Lord of Morgul and his company to assail without great force of war."
        },
        {
            "author": "Queen Erendis of Númenor, Unfinished Tales",
            "quote": "'We also are daughters of the great, and we have wills and courage of our own.'"
        },
        {
            "author": "Beregond, Citadel Guard, Minas Tirith",
            "quote": "'Here, the hammer-stroke will fall hardest.'"
        },
        {
            "author": "Unfinished Tales; The Hunt for the Ring",
            "quote": "Such was still the power of the voice of Saruman that even the Lord of the Nazgûl did not question what it said..."
        },
        {
            "author": "Saruman the White, The Hunt for the Ring",
            "quote": "He was himself so far fallen that he believed all others of the Council had each their deep and far-reaching policies for their own enhancement."
        },
        {
            "author": "Isengard's invasion, Unfinished Tales",
            "quote": "If the invasion of Westfold had begun five days earlier, there can be little doubt that the reinforcements from Edoras would never have come near Helm's Deep..."
        },
        {
            "author": "Akallabêth - The Downfall of Númenor",
            "quote": "...the Elf-friends... alone came now ever to the north and the land of Gil-galad, keeping their friendship with the Elves and lending them aid against Sauron."
        },
        {
            "author": "Akallabêth - The Downfall of Númenor",
            "quote": "...the Elf-friends... haven was Pelargir above the mouths of Anduin the Great."
        },
        {
            "author": "about Sauron, Akallabêth - The Downfall of Númenor",
            "quote": "...he had fortified the land of Mordor and had built there the Tower of Barad-dûr..."
        },
        {
            "author": "about Sauron, Akallabêth - The Downfall of Númenor",
            "quote": "...nor did he forget the aid that Tar-Minastir had rendered to Gil-galad of old, in that time when the One Ring was forged and there was war between Sauron and the Elves in Eriador."
        },
        {
            "author": "on Sauron about Númenóreans, Akallabêth",
            "quote": "...and he feared them, lest they should invade his lands and wrest from him the dominion of the East."
        },
        {
            "author": "Akallabêth - The Downfall of Númenor",
            "quote": "Yet Sauron was ever guileful, and it is said that among those whom he ensnared with the Nine Rings, three were great lords of Númenórean race."
        },
        {
            "author": "Unfinished Tales",
            "quote": "Ever afterwards Moria had Sauron's hate, and all Orcs were commanded to harry Dwarves whenever they might."
        },
        {
            "author": "Sauron's forces are cast out, Unfinished Tales",
            "quote": "Eriador was cleared of the enemy, but lay largely in ruins."
        },
        {
            "author": "King Ar-Pharazôn of Númenor, Akallabêth",
            "quote": "...he brooded darkly, thinking of war. For he had learned in Middle-earth of the strength of the realm of Sauron, and of his hatred of Westernesse."
        },
        {
            "author": "Unfinished Tales",
            "quote": "Celeborn went at first to Lórien and fortified it against any further attempts of Sauron to cross the Anduin."
        },
        {
            "author": "Gondor, Of the Rings of Power and the Third Age",
            "quote": "...and the Winged Crown of the Kings of Men was held in awe by people of many lands and tongues."
        },
        {
            "author": "Legolas about Imrahil, The Last Debate",
            "quote": "...for he saw that here indeed was one who had Elven-blood in his veins."
        },
        {
            "author": "Akallabêth - The Downfall of Númenor",
            "quote": "Then behind locked doors Sauron spoke to the King, and he lied, saying: '...his name is Melkor, Lord of All, Giver of Freedom, and he shall make you stronger than Valar.'"
        },
        {
            "author": "Isildur to his son, Unfinished Tales",
            "quote": "'Forgive me, and my pride that has brought you to this doom.'"
        },
        {
            "author": "Unfinished Tales",
            "quote": "Thranduil, father of Legolas of the Nine Walkers, was Sindarin, and that tongue was used in his house, though not by all his folk."
        },
        {
            "author": "Unfinished Tales",
            "quote": "In Lórien, where many of tile people were Sindar in origin, or Ñoldor, survivors from Eregion, Sindarin had become the language of all the people."
        },
        {
            "author": "Unfinished Tales; The Disaster of the Gladden Fields",
            "quote": "...they heard the hideous cries of Orcs, and saw them issuing from the Forest and moving down the slopes, yelling their war-cries."
        },
        {
            "author": "Akallabêth - The Downfall of Númenor",
            "quote": "...Sauron stood there upon the pinnacle and defied the lightning and was unharmed; and in that hour, men called him a god and did all that he would."
        },
        {
            "author": "Éomer, Third Marshal, The Riders of Rohan",
            "quote": "'...and we overtook the Orcs at nightfall two days ago, near to the borders of the Entwood.'"
        },
        {
            "author": "Unfinished Tales; The Disaster of the Gladden Fields",
            "quote": "That was the manner of Orcs, who were most often dismayed when their prey could turn and bite."
        },
        {
            "author": "Uruk-hai raiders killed, The Riders of Rohan",
            "quote": "Upon a stake in the middle was set a great Goblin head; upon its shattered helm, the white badge could still be seen."
        },
        {
            "author": "Unfinished Tales",
            "quote": "...Éomer, had as his ward the East-mark with his base at his home, Aldburg in the Folde."
        },
        {
            "author": "Many Partings",
            "quote": "The Dunlendings fled and hid themselves, for they were afraid of Elvish Folk."
        },
        {
            "author": "Akallabêth - The Downfall of Númenor",
            "quote": "Númenor went down into the sea... and all its gardens and its halls and its towers, its tombs and its riches... and its lore: they vanished for ever."
        },
        {
            "author": "Akallabêth - The Downfall of Númenor",
            "quote": "Nine ships there were: four for Elendil, and for Isildur three, and for Anárion two; and they fled before the black gale out of the twilight of doom into the darkness of the world."
        },
        {
            "author": "Akallabêth - The Downfall of Númenor",
            "quote": "Elendil and his sons after founded kingdoms in Middle-earth... though their lore and craft was but an echo of that which had been ere Sauron came to Númenor..."
        },
        {
            "author": "about Sauron, Akallabêth",
            "quote": "...he was robbed now of that shape in which he had wrought so great an evil, so that he could never again appear fair to the eyes of Men."
        },
        {
            "author": "Akallabêth - The Downfall of Númenor",
            "quote": "There he took up again his great Ring in Barad-dûr, and dwelt there, dark and silent, until he wrought himself a new guise, an image of malice and hatred made visible."
        },
        {
            "author": "Akallabêth - The Downfall of Númenor",
            "quote": "For Sauron himself was filled with great fear at the wrath of the Valar, and the doom that Eru laid upon sea and land."
        },
        {
            "author": "Treebeard about Saruman, Many Partings",
            "quote": "'He always was hasty. That was his ruin.'"
        },
        {
            "author": "about Sauron, Of the Rings of Power and the Third Age",
            "quote": "...for long if he willed he could still appear noble and beautiful, so as to deceive all but the most wary."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "Gil-galad, son of Fingon, was Lindon's King, and with him was Elrond Half-Elven, son of Eärendil the Mariner and brother of Elros, first king of Númenor."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "...survivors of Doriath and Ossiriand... established realms among the Silvan Elves in woods and mountains far from the sea, for which nonetheless they ever yearned in their hearts."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "Eregion was nigh to the great mansions of the Dwarves that were named Khazad-dûm, but by the Elves Hadhodrond, and afterwards Moria."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "From Ost-in-Edhil, the city of the Elves, the highroad ran to the west gate of Khazad-dûm, for a friendship arose between Dwarves and Elves..."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "In Eregion, the craftsmen of the Gwaith-i-Mírdain, the People of the Jewel-smiths, surpassed in cunning all that have ever wrought, save only Fëanor himself."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "And in the south and in the further east Men multiplied; and most of them turned to evil, for Sauron was at work."
        },
        {
            "author": "Isildur's last battle, Unfinished Tales",
            "quote": "The Orcs might pay five to one in this exchange, but it was too cheap."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "In those days, the smiths of Ost-in-Edhil surpassed all that they had contrived before... and they made Rings of Power. But Sauron guided their labours..."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "Now the Elves made many rings; but secretly Sauron made One Ring to rule all the others, and their power was bound up with it, to be subject wholly to it..."
        },
        {
            "author": "Sauron and the Elves, Of the Rings of Power and the Third Age",
            "quote": "...and he came against them with open war, demanding that all the rings should be delivered to him..."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "Now these were the Three that had last been made, and they possessed the greatest powers. Narya, Nenya, and Vilya, they were named, the Rings of Fire, and of Water, and of Air..."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "Sauron gathered into his hands all the remaining Rings of Power; and he dealt them out to the other peoples of Middle-earth..."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "Seven Rings he gave to the Dwarves; but to Men he gave nine, for Men proved in this matter as in others the readiest to his will."
        },
        {
            "author": "on the seven rings of the Dwarves, Silmarillion",
            "quote": "They used their rings only for the getting of wealth; but wrath and an over-mastering greed of gold were kindled in their hearts, of which evil enough after came..."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "It is said that the foundation of each of the Seven Hoards of the Dwarf-kings of old was a golden ring; but all those hoards long ago were plundered and the Dragons devoured them..."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "Those who used the Nine Rings became mighty in their day, kings, sorcerers, and warriors of old."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "The Nazgûl were they, the Ringwraiths, the Enemy's most terrible servants; darkness went with them, and they cried with the voices of death."
        },
        {
            "author": "about Sauron, Of the Rings of Power and the Third Age",
            "quote": "...and he gathered again under his government all the evil things of the days of Morgoth that remained on earth or beneath it, and the Orcs were at his command..."
        },
        {
            "author": "Sauron's servants, Of the Rings of Power and the Third Age",
            "quote": "...east and south well nigh all Men... grew strong in those days and built many towns and walls of stone, and they were numerous and fierce in war and aimed with iron."
        },
        {
            "author": "Southrons and Easterlings, Of the Rings of Power and the Third Age",
            "quote": "To them, Sauron was both king and god; and they feared him exceedingly, for he surrounded his abode with fire."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "The chief of these were Elendil the Tall and his sons, Isildur and Anárion. Kinsmen of the King they were, descendants of Elros..."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "At Fornost upon the North Downs also the Númenóreans dwelt, and in Cardolan, and in the hills of Rhudaur; and towers they raised upon Emyn Beraid and upon Amon Sûl."
        },
        {
            "author": "about Elendil, Silmarillion",
            "quote": "...his chief city was at Annúminas beside the water of Lake Nenuial."
        },
        {
            "author": "Isildur and Anárion, Of the Rings of Power and the Third Age",
            "quote": "...and they established a realm in those lands that were after called Gondor, whereas the Northern Kingdom was named Arnor."
        },
        {
            "author": "Gondor, Of the Rings of Power and the Third Age",
            "quote": "The chief city of this southern realm was Osgiliath, through the midst of which the Great River flowed."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "Many treasures and great heirlooms of virtue and wonder the Exiles had brought from Númenor; and of these the most renowned were the Seven Stones and the White Tree."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "And Sauron gathered to him great strength of his servants out of the east and the south; and among them were not a few of the high race of Númenor."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "Now Elendil and Gil-galad... made that League which is called the Last Alliance, and they marched east into Middle-earth gathering a great host of Elves and Men."
        },
        {
            "author": "Isildur's last battle, Unfinished Tales",
            "quote": "At that moment there came a sudden blast of horns, and the Orcs closed in on all sides, flinging themselves against the Dúnedain with reckless ferocity."
        },
        {
            "author": "The Last Alliance, Silmarillion",
            "quote": "Of the Dwarves, few fought upon either side; but the kindred of Durin of Moria fought against Sauron."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "The host of Gil-galad and Elendil had the victory, for the might of the Elves was still great in those days, and the Númenóreans were strong and tall, and terrible in their wrath."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "...Sauron also was thrown down, and with the hilt-shard of Narsil, Isildur cut the Ruling Ring from the hand of Sauron and took it for his own."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "The Númenóreans indeed set a guard upon the land of Mordor, but none dared dwell there because of the terror of the memory of Sauron..."
        },
        {
            "author": "Isildur about the One, Of the Rings of Power and the Third Age",
            "quote": "‘This I will have as were-gild for my father's death, and my brothers. Was it not I that dealt the Enemy his death-blow?'"
        },
        {
            "author": "about reforging Narsil, Silmarillion",
            "quote": "And Master Elrond foretold that this would not be done until the Ruling Ring should be found again and Sauron should return."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "...the Men of Westernesse, the Dúnedain of the North, became divided into petty realms and lordships, and their foes devoured them one by one."
        },
        {
            "author": "the Northern Dúnedain, Silmarillion",
            "quote": "...other men knew not their homes nor the purpose of their journeys, and save in Imladris, in the house of Elrond, their ancestry was forgotten."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "In the south, the realm of Gondor endured, and for a time its splendour grew, until it recalled the wealth and majesty of Númenor ere it fell."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "High towers the people of Gondor built, and strong places, and havens of many ships."
        },
        {
            "author": "Nazgûl, Of the Rings of Power and the Third Age",
            "quote": "... and took Minas Ithil for their abode; and they made it a place of such dread that none dared to look upon it."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "...it was called Minas Morgul, the Tower of Sorcery; and Minas Morgul was ever at war with Minas Anor in the west."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "...Osgiliath, which in the waning of the people had long been deserted, became a place of ruins and a city of ghosts."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "Minas Anor endured, and it was named anew Minas Tirith, the Tower of Guard."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "...the remnant of the Númenóreans still defended the passage of the River against the terrors of Minas Morgul and against all the enemies of the West, Orcs and monsters and evil Men."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "...when the line of the Kings failed, the Stewards of the house of Mardil the Faithful ruled the city and its ever-shrinking realm."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "...the Rohirrim, the Horsemen of the North, came and dwelt in the green land of Rohan... and the Rohirrim aided the Lords of the City in their wars."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "...beyond the Falls of Rauros and the Gates of Argonath, there were as yet other defences, powers more ancient of which Men knew little, against whom the things of evil did not dare to move."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "In Eriador, Imladris was the chief dwelling of the High Elves; but at the Grey Havens of Lindon, there abode also a remnant of the people of Gil-galad the Elvenking."
        },
        {
            "author": "Galadriel, Of the Rings of Power and the Third Age",
            "quote": "A queen she was of the woodland Elves, the wife of Celeborn of Doriath, yet she herself was of the Ñoldor and remembered the Day before days in Valinor..."
        },
        {
            "author": "Galadriel, Of the Rings of Power and the Third Age",
            "quote": "...and she was the mightiest and fairest of all the Elves that remained in Middle-earth."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "Orcs there were and trolls and dragons and fell beasts, and strange creatures old and wise in the woods whose names are forgotten."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "Dwarves still laboured in the hills and wrought with patient craft works of metal and stone that none now can rival."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "Then the name of the forest was changed and Mirkwood it was called, for the nightshade lay deep there... save only in the north where Thranduil’s people still held the evil at bay."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "Even as the first shadows were felt in Mirkwood, there appeared in the west of Middle-earth the Istari, whom Men called the Wizards."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "Of these, Curunír was the eldest and came first, and after him came Mithrandir and Radagast, and others of the Istari who went into the east of Middle-earth..."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "Galadriel indeed had wished that Mithrandir should be the Lead of the Council, and Saruman begrudged them that, for his pride and desire of mastery was grown great."
        },
        {
            "author": "Elrond, Of the Rings of Power and the Third Age",
            "quote": "‘In the hour that Isildur took the Ring and would not surrender it, this doom was wrought, that Sauron should return.’"
        },
        {
            "author": "about Saruman, Of the Rings of Power and the Third Age",
            "quote": "Too long he had studied the ways of Sauron in hope to defeat him, and now he envied him as a rival rather than hated his works."
        },
        {
            "author": "about Saruman, Of the Rings of Power and the Third Age",
            "quote": "...he desired that he and no other should find the Great Ring, so that he might wield it himself and order all the world to his will."
        },
        {
            "author": "Gandalf, Of the Rings of Power and the Third Age",
            "quote": "'The might of the Elves and the Elf-friends is less now than of old. Soon he will be too strong for you, even without the Great Ring.'"
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "Orcs were mustering, and far to the east and the south the wild peoples were arming."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "Then war was kindled, and in battle with Sauron, the Third Age ended even as it had begun."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "He was Aragorn son of Arathorn, the nine and thirtieth heir in the right line from Isildur, and yet more like to Elendil than any before him."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "In that last battle were Mithrandir, and the sons of Elrond, and the King of Rohan, and lords of Gondor, and the Heir of Isildur with the Dúnedain of the North."
        },
        {
            "author": "Círdan to Gandalf about the Red Ring, Silmarillion",
            "quote": "‘Take now this Ring,’ he said; 'for thy labours and thy cares will be heavy, but in all it will support thee and defend thee from weariness.'"
        },
        {
            "author": "The Shadow of the Past",
            "quote": "The ancient East-West Road ran through the Shire to its end at the Grey Havens, and dwarves had always used it on their way to their mines in the Blue Mountains."
        },
        {
            "author": "Glóin, Dwarven Lord, to Frodo, Many Meetings",
            "quote": "'Only in mining and building have we surpassed the old days.'"
        },
        {
            "author": "Durin's Folk",
            "quote": "...the Grey Mountains, where most of Durin's folk were now gathering; for those mountains were rich and little explored. But there were dragons in the wastes beyond..."
        },
        {
            "author": "Thorin II Oakenshield, The Hobbit",
            "quote": "'Fathers would beg us to take their sons as apprentices, and pay us handsomely, especially in food-supplies, which we never bothered to grow or find for ourselves.'"
        },
        {
            "author": "Thorin II Oakenshield, The Hobbit",
            "quote": "'...They grew immensely rich and famous, and my grandfather was King under the Mountain again and treated with great reverence by the mortal men.'"
        },
        {
            "author": "Thorin II Oakenshield, The Hobbit",
            "quote": "'So my grandfather's halls became full of armour and jewels and carvings and cups... Undoubtedly, that was what brought the dragon.'"
        },
        {
            "author": "The Tale of Years: The Third Age",
            "quote": "...Easterlings had the victory. But they could not take the Gate and many, both Dwarves and Men, took refuge in Erebor..."
        },
        {
            "author": "Gandalf reads the record of Balin's people, The Bridge of Khazad-dûm",
            "quote": "'\"We cannot get out. The end comes,\" and then \"drums, drums in the deep.\" I wonder what that means. The last thing written is in a trailing scrawl of elf-letters: \"They are coming.\"'"
        },
        {
            "author": "Glóin, Dwarven Lord, The Council of Elrond",
            "quote": "'Some spoke of Moria... and they declared that now at last we had the power and numbers to return.'"
        },
        {
            "author": "Glóin, Dwarven Lord, The Council of Elrond",
            "quote": "'...messages reported that Moria had been entered and a great work begun there. Then there was silence, and no word has ever come from Moria since.'"
        },
        {
            "author": "Dáin II Ironfoot to Thorin II Oakenshield, Durin's Folk",
            "quote": "'You will not enter Khazad-dûm. Only I have looked through the shadow of the Gate. Beyond the shadow it waits for you still: Durin's Bane.'"
        },
        {
            "author": "about Moria, Durin's Folk",
            "quote": "The Dwarves delved deep at that time, seeking beneath Barazinbar for mithril... Thus they roused from sleep a thing of terror..."
        },
        {
            "author": "the Orcs of the Misty Mountains, The Hobbit",
            "quote": "Messengers had passed to and fro between all their cities, colonies and strongholds; for they resolved now to win the dominion of the North."
        },
        {
            "author": "the Orcs of the Misty Mountains, The Hobbit",
            "quote": "...around and beneath the great mountain Gundabad of the North, where was their capital, a vast host was assembled ready to sweep down in time of storm unawares upon the South."
        },
        {
            "author": "the Raven and Bard, The Hobbit",
            "quote": "Unafraid it perched by his ear and it brought him news. Marvelling, he found he could understand its tongue, for he was of the race of Dale."
        },
        {
            "author": "about Bard the Bowman, The Hobbit",
            "quote": "He was drenched with water, his black hair hung wet over face and shoulders, and a fierce light was in his eyes."
        },
        {
            "author": "The Hobbit",
            "quote": "But there was still a company of archers that held their ground among the burning houses. Their captain was Bard, grim-voiced and grim-faced..."
        },
        {
            "author": "Laketown, The Hobbit",
            "quote": "They still throve on the trade... but in the great days of old, when Dale in the North was rich and prosperous, they had been wealthy and powerful..."
        },
        {
            "author": "The Hobbit",
            "quote": "Bard at once had speedy messengers... to ask the aid of the King of the Elves of the Wood..."
        },
        {
            "author": "King Thranduil, The Hobbit",
            "quote": "...when he received the prayers of Bard, he had pity, for he was the lord of a good and kindly people."
        },
        {
            "author": "Glóin, Dwarven Lord, to Frodo, Many Meetings",
            "quote": "'Nowhere are there any men so friendly to us as the Men of Dale. They are good folk, the Bardings.'"
        },
        {
            "author": "Aragorn, The Riders of Rohan",
            "quote": "'Eorlingas kinship is with the Bardings of Dale, and with the Beornings of the Wood, among whom may still be seen many men tall and fair, as are the Riders of Rohan...'"
        },
        {
            "author": "Glóin about Dale, The Council of Elrond",
            "quote": "'Already war is gathering on his eastern borders. If we make no answer, the Enemy may move Men of his rule to assail King Brand, and Dáin also.'"
        },
        {
            "author": "The Tale of Years: The Third Age",
            "quote": "...a host of the allies of Sauron that had long threatened the borders of King Brand crossed the River Carnen, and Brand was driven back to Dale."
        },
        {
            "author": "The Tale of Years: The Third Age",
            "quote": "The battle lasted three days, but in the end, both King Brand of Dale and King Dáin Ironfoot were slain, and the Easterlings had the victory."
        },
        {
            "author": "Easterlings at Erebor, The Tale of Years: The Third Age",
            "quote": "...and the besieged came forth and routed them, and the remnant fled into the East and troubled Dale no more."
        },
        {
            "author": "Gandalf about Dáin II Ironfoot, Durin's Folk",
            "quote": "'...in his great age he could still wield his axe as mightily as they say that he did... before the Gate of Erebor until the darkness fell.'"
        },
        {
            "author": "Thorin II Oakenshield, The Hobbit",
            "quote": "'But go specially to my cousin Dáin in the Iron Hills, for he has many people well-armed, and dwells nearest to this place.'"
        },
        {
            "author": "the Orc Chieftain's end, Durin's Folk",
            "quote": "It was Dáin Ironfoot, Náin's son. Right before the doors he caught Azog, and there he slew him, and hewed off his head."
        },
        {
            "author": "Durin's Folk",
            "quote": "Dáin proved a great and wise king, and the Dwarves prospered and grew strong again in his day."
        },
        {
            "author": "Many Meetings",
            "quote": "Glorfindel was tall and straight; his hair was of shining gold, his face fair and young and fearless and full of joy ... On his brow sat wisdom, and in his hand was strength."
        },
        {
            "author": "Gandalf about Glorfindel, Many Meetings",
            "quote": "'Yes, you saw him for a moment as he is upon the other side: one of the mighty of the Firstborn. He is an Elf-lord of a house of princes.'"
        },
        {
            "author": "Glorfindel about Nazgûl, Flight to the Ford",
            "quote": "'Three of the servants of Sauron were upon the Bridge, but they withdrew and I pursued them westward. I came also upon two others, but they turned away southward.'"
        },
        {
            "author": "Unfinished Tales",
            "quote": "Of Khamûl, it is said here that he was the most ready of all the Nazgûl, after the Black Captain himself, to perceive the presence of the ring..."
        },
        {
            "author": "the Nazgûl, A Knife in the Dark",
            "quote": "In their white faces burned keen and merciless eyes; under their mantles were long grey robes; upon their grey hairs were helms of silver."
        },
        {
            "author": "Gondor and the Heirs of Anárion",
            "quote": "In the last years of Denethor I, the race of Uruks, black Orcs of great strength, first appeared out of Mordor, and in 2475 they swept across Ithilien and took Osgiliath."
        },
        {
            "author": "The Battle of the Pelennor Fields",
            "quote": "A crown of steel he bore, but between rim and robe naught was there to see, save only a deadly gleam of eyes: the Lord of the Nazgûl."
        },
        {
            "author": "the Nazgûl, The Siege of Gondor",
            "quote": "...their deadly voices rent the air. More unbearable they became, not less, at each new cry."
        },
        {
            "author": "Concerning Hobbits",
            "quote": "To the last battle at Fornost with the Witch-lord of Angmar, they sent some bowmen to the aid of the King, or so they maintained, though no tales of Men record it."
        },
        {
            "author": "The Realms in Exile: The Southern Line",
            "quote": "But Glorfindel rode up then on his white horse, and in the midst of his laughter, the Witch-king turned to flight and passed into the shadows."
        },
        {
            "author": "The Peoples of Middle-earth",
            "quote": "The remnants of the Dúnedain of the North become rangers and errants, living largely in hiding, but waging ceaseless war on all evil things that still are abroad in the land."
        },
        {
            "author": "Unfinished Tales",
            "quote": "With Isildur went... his Guard of two hundred knights and soldiers, stern men of Arnor and war-hardened."
        },
        {
            "author": "Isildur's Arnorians, Unfinished Tales",
            "quote": "The arrows had been unavailing against the Númenórean armour. The great Men towered above the tallest Orcs, and their swords and spears far outreached the weapons of their enemies."
        },
        {
            "author": "Unfinished Tales",
            "quote": "Isildur commanded a thangail to be drawn up, a shield-wall of two serried ranks that could be bent back at either end if outflanked, until at need it became a closed ring."
        },
        {
            "author": "Isildur's last battle, Unfinished Tales",
            "quote": "The Orcs... hurled a great mass of their chief warriors down the last slope against the Dúnedain, expecting to break up their shield-wall. But it stood firm."
        },
        {
            "author": "about Elrond, Many Meetings",
            "quote": "Venerable he seemed as a king crowned with many winters, and yet hale as a tried warrior in the fullness of his strength."
        },
        {
            "author": "about Elrond, The Hobbit",
            "quote": "He was as noble and as fair in face as an Elf-lord, as strong as a warrior, as wise as a wizard, as venerable as a king of dwarves, and as kind as summer."
        },
        {
            "author": "Elrond's sons, Many Meetings",
            "quote": "Elladan and Elrohir, were out upon errantry: for they rode often far afield with the Rangers of the North..."
        },
        {
            "author": "Elrond to Thórin II Oakenshield, The Hobbit",
            "quote": "'These are... very old... This, Thorin, the runes name Orcrist, the Goblin-cleaver in the ancient tongue of Gondolin...'"
        },
        {
            "author": "Elrond about the Last Alliance, The Council of Elrond",
            "quote": "'It recalled to me the glory of the Elder Days and the hosts of Beleriand, so many great princes and captains were assembled.'"
        },
        {
            "author": "about Elladan and Elrohir, The House of Eorl",
            "quote": "In the forefront of the charge, they saw two great horsemen, clad in grey, unlike all the others, and the Orcs fled before them."
        },
        {
            "author": "Gondor and the Heirs of Anárion",
            "quote": "Denethor was a proud man, tall, valiant, and more kingly than any man that had appeared in Gondor for many lives of men; and he was wise also, and far-sighted, and learned in lore."
        },
        {
            "author": "about Denethor II, The Heirs of Elendil",
            "quote": "It is said that he dared to use the Palantír of the White Tower... and so saw much of the mind of Sauron... but was aged prematurely by this combat, and fell into despair."
        },
        {
            "author": "about Denethor II, Unfinished Tales",
            "quote": "He was proud, but this was by no means merely personal: he loved Gondor and its people, and deemed himself appointed by destiny to lead them in this desperate time."
        },
        {
            "author": "Gandalf about Denethor II, Minas Tirith",
            "quote": "'He is not as other men of this time, Pippin, and whatever be his descent from father to son, by some chance the blood of Westernesse runs nearly true in him.'"
        },
        {
            "author": "Denethor II, The Siege of Gondor",
            "quote": "He stood up and cast open his long black cloak, and behold! he was clad in mail beneath, and girt with a long sword, great-hilted in a sheath of black and silver."
        },
        {
            "author": "Éomer about Boromir, The Riders of Rohan",
            "quote": "'That was a worthy man! All spoke his praise. He came seldom to the Mark, for he was ever in the wars on the East-borders.'"
        },
        {
            "author": "Boromir, The Council of Elrond",
            "quote": "'...my brother... was eager to heed the dream and seek for Imladris; but since the way was full of doubt and danger, I took the journey upon myself.'"
        },
        {
            "author": "The Heirs of Elendil",
            "quote": "The sons of Denethor resisted the Ringwraiths but were defeated by the Black Captain... but they still held West Osgiliath."
        },
        {
            "author": "Boromir, The Council of Elrond",
            "quote": "'We were outnumbered, for Mordor has allied itself with the Easterlings and the cruel Haradrim.'"
        },
        {
            "author": "Beregond, Citadel Guard, Minas Tirith",
            "quote": "'Boromir it was that drove the enemy at last back from this western shore, and we hold still the near half of Osgiliath.'"
        },
        {
            "author": "The Siege of Gondor",
            "quote": "Faramir was retreating to the wall of the Pelennor, rallying his men to the Causeway Forts; but he was ten times outnumbered."
        },
        {
            "author": "The Siege of Gondor",
            "quote": "There came great beasts, like moving houses in the red and fitful light, the Mûmakil of the Harad dragging through the lanes amid the fires huge towers and engines."
        },
        {
            "author": "The Battle of the Pelennor Fields",
            "quote": "...from the southward fields came footmen of Harad with horsemen before them, and behind them rose the huge backs of the Mûmakil with war-towers upon them."
        },
        {
            "author": "The Battle of the Pelennor Fields",
            "quote": "...both Duilin of Morthond and his brother were trampled to death when they assailed the Mûmakil, leading their bowmen close to shoot at the eyes of the monsters."
        },
        {
            "author": "the Ent Elder, Treebeard",
            "quote": "'But Trolls are only counterfeits, made by the Enemy in the Great Darkness, in mockery of Ents, as Orcs were of Elves. We are stronger than Trolls.'"
        },
        {
            "author": "about King Helm of Rohan, The House of Eorl",
            "quote": "...he would go out by himself, clad in white, and stalk like a snow-troll into the camps of his enemies..."
        },
        {
            "author": "Gandalf, The Bridge of Khazad-dûm",
            "quote": "'...there is something else there. A great cave-troll, I think, or more than one.'"
        },
        {
            "author": "The Languages and Peoples of the Third Age",
            "quote": "...a troll-race not before seen appeared in southern Mirkwood and in the mountain borders of Mordor. Olog-hai they were called in the Black Speech."
        },
        {
            "author": "Grond, The Siege of Gondor",
            "quote": "...and in the midst was a huge ram... Great beasts drew it... and behind walked mountain-trolls to wield it."
        },
        {
            "author": "Olog-hai, The Languages and Peoples of the Third Age",
            "quote": "Trolls they were, but filled with the evil will of their master: a fell race, strong, agile, fierce and cunning, but harder than stone."
        },
        {
            "author": "The Black Gate Opens",
            "quote": "Then Pippin stabbed upwards, and the written blade of Westernesse pierced through the hide and went deep into the vitals of the troll..."
        },
        {
            "author": "The Battle of the Pelennor Fields",
            "quote": "East rode the knights of Dol Amroth driving the enemy before them: Troll-men and Variags and Orcs that hated the sunlight."
        },
        {
            "author": "The Battle of the Pelennor Fields",
            "quote": "Easterlings with axes, and Variags of Khand, Southrons in scarlet, and out of Far Harad black men like half-trolls with white eyes and red tongues."
        },
        {
            "author": "The Battle of the Pelennor Fields",
            "quote": "'The Corsairs of Umbar!' men shouted... 'The Corsairs are upon us! It is the last stroke of doom!'"
        },
        {
            "author": "Éomer, The Battle of the Pelennor Fields",
            "quote": "For once more lust of battle was on him; and he was still unscathed, and he was young, and he was king: the lord of a fell people."
        },
        {
            "author": "Faramir to Frodo, The Window on the West",
            "quote": "'I would not take this thing... Not were Minas Tirith falling in ruin and I alone could save her, so, using the weapon of the Dark Lord for her good and my glory.'"
        },
        {
            "author": "Rangers of Ithilien, Of Herbs and Stewed Rabbit",
            "quote": "All were hooded and masked, and had gauntlets on their hands, and were armed like Faramir and his companions."
        },
        {
            "author": "about Osgiliath's defence, The Siege of Gondor",
            "quote": "'It is not strong,' said Faramir. 'I have sent the company of Ithilien to strengthen it, as I have said.'"
        },
        {
            "author": "Minas Tirith",
            "quote": "...in the great fief of Belfalas, dwelt Prince Imrahil in his castle of Dol Amroth by the sea, and he was of high blood, and his folk also, tall men and proud with sea-grey eyes."
        },
        {
            "author": "The Battle of the Pelennor Fields",
            "quote": "Aragorn and Éomer and Imrahil...  their fortune and the skill and might of their arms, and few indeed had dared to abide them or look on their faces in the hour of their wrath."
        },
        {
            "author": "Gandalf the White, The Siege of Gondor",
            "quote": "...and with him went the Prince of Dol Amroth in his shining mail. For he and his knights still held themselves like lords in whom the race of Númenor ran true..."
        },
        {
            "author": "Forlong the Fat, Lord of Lossarnach, Minas Tirith",
            "quote": "Behind him marched proudly a dusty line of men, well-armed and bearing great battle-axes; grim-faced they were..."
        },
        {
            "author": "Minas Tirith",
            "quote": "From the uplands of Morthond, the great Blackroot Vale, tall Duinhir with his sons, Duilin and Derufin, and five hundred bowmen."
        },
        {
            "author": "Beregond about the Corsairs, Minas Tirith",
            "quote": "'For this attack will draw off much of the help that we looked to have from Lebennin and Belfalas, where folk are hardy and numerous.'"
        },
        {
            "author": "the Corsairs of Umbar, Minas Tirith",
            "quote": "They have long ceased to fear the might of Gondor, and they have allied them with the Enemy, and now make a heavy stroke in his cause."
        },
        {
            "author": "Gimli, The Last Debate",
            "quote": "'...at Pelargir lay the main fleet of Umbar, fifty great ships and smaller vessels beyond count.'"
        },
        {
            "author": "Castamir the Usurper, Gondor and the Heirs of Anárion",
            "quote": "...he had the greatest following of all the rebels; for he was the Captain of Ships, and was supported by the people of the coasts and of the great havens of Pelargir and Umbar."
        },
        {
            "author": "The Battle of the Pelennor Fields",
            "quote": "'But no living man am I! You look upon a woman. Éowyn I am, Éomund's daughter. You stand between me and my lord and kin.'"
        },
        {
            "author": "Éowyn, The Battle of the Pelennor Fields",
            "quote": "'Begone, if you be not deathless! For living or dark undead, I will smite you, if you touch him.'"
        },
        {
            "author": "Death of the Southrons Lord, The Battle of the Pelennor Fields",
            "quote": "Right through the press drove Théoden Thengel's son, and his spear was shivered as he threw down their chieftain."
        },
        {
            "author": "Théoden, The Ride of the Rohirrim",
            "quote": "Fey he seemed, or the battle-fury of his fathers ran like new fire in his veins, and he was borne up on Snowmane like a god of old..."
        },
        {
            "author": "Rohirrim's charge, The Battle of the Pelennor Fields",
            "quote": "Well nigh all the northern half of the Pelennor was overrun, and there camps were blazing, Orcs were flying towards the River like herds before the hunters."
        },
        {
            "author": "about Thengel, The House of Eorl",
            "quote": "But he proved a good and wise king."
        },
        {
            "author": "The House of Eorl",
            "quote": "It was soon after Thengel's return that Saruman declared himself Lord of Isengard and began to give trouble to Rohan, encroaching on its borders and supporting its enemies."
        },
        {
            "author": "about Thorongil (Aragorn), Gondor and the Heirs of Anárion",
            "quote": "At last he got leave of the Steward and gathered a small fleet, and he came to Umbar unlooked-for by night, and there burned a great part of the ships of the Corsairs."
        },
        {
            "author": "Halbarad the Ranger to Aragorn, The Passing of the Grey Company",
            "quote": "'I have thirty with me... That is all of our kindred that could be gathered in haste; but the brethren Elladan and Elrohir have ridden with us, desiring to go to the war.'"
        },
        {
            "author": "The Siege of Gondor",
            "quote": "And from the walls, an answering shout went up; for foremost on the field rode the swan-knights of Dol Amroth with their Prince and his blue banner at their head."
        },
        {
            "author": "The Siege of Gondor",
            "quote": "But about the Gate resistance still was stout, and there the knights of Dol Amroth and the hardiest of the garrison stood at bay."
        },
        {
            "author": "The Battle of the Pelennor Fields",
            "quote": "...and out of the City came all the strength of men that was in it, and the silver swan of Dol Amroth was borne in the van, driving the enemy from the Gate."
        },
        {
            "author": "The Council of Elrond",
            "quote": "There was also a strange Elf clad in green and brown, Legolas, a messenger from his father, Thranduil, the King of the Elves of Northern Mirkwood."
        },
        {
            "author": "Hirgon, errand-rider of Denethor, The Muster of Rohan",
            "quote": "'It is reported to us that many kings have ridden in from the East to the service of Mordor. From the North to the field of Dagorlad there is skirmish and rumour of war.'"
        },
        {
            "author": "Shagrat, Orc commander, The Tower of Cirith Ungol",
            "quote": "'You won't go again, you say? Curse you, Snaga, you little maggot!'"
        },
        {
            "author": "Shagrat, Orc commander, The Tower of Cirith Ungol",
            "quote": "'Come here, and I'll squeeze your eyes out, like I did to Radbug just now.'"
        },
        {
            "author": "to Éomer, Helm's Deep",
            "quote": "'Come!' said Aragorn. 'This is the hour when we draw swords together!'"
        },
        {
            "author": "Gimli son of Glóin, Helm's Deep",
            "quote": "'The Orcs are behind the wall.... Come, Legolas! There are enough for us both. Khazâd ai-mênu!'"
        },
        {
            "author": "Gamling, Commander of Rohan, Helm's Deep",
            "quote": "'The Orcs are in the Deep!' he cried. 'Helm! Helm! Forth Helmingas.'"
        },
        {
            "author": "Unfinished Tales",
            "quote": "Oropher was of Sindarin origin, and no doubt Thranduil his son was following the example of King Thingol long before, in Doriath; though his halls were not to be compared with Menegroth."
        },
        {
            "author": "Gandalf about Grima to Théoden, The King of the Golden Hall",
            "quote": "'To slay it would be just. But it was not always as it now is. Once it was a man, and did you service in its fashion...'"
        },
        {
            "author": "The King of the Golden Hall",
            "quote": "'I am the doorward of Théoden,' he said. Háma is my name.'"
        },
        {
            "author": "Gandalf to the Witch-king, The Siege of Gondor",
            "quote": "'Go back to the abyss prepared for you! Go back! Fall into the nothingness that awaits you and your Master. Go!'"
        },
        {
            "author": "The Siege of Gondor",
            "quote": "In dark Mindolluin's sides they dimly echoed. Great horns of the North wildly blowing. Rohan had come at last."
        },
        {
            "author": "the Gate of Minas Tirith, The Siege of Gondor",
            "quote": "...wrought of steel and iron, and guarded with towers and bastions of indomitable stone, yet it was the key, the weakest point in all that high and impenetrable wall."
        },
        {
            "author": "Sauron's Horde, The Siege of Gondor",
            "quote": "The plain was dark with their marching companies, and as far as eyes could strain in the mirk there sprouted... all about the beleaguered city great camps of tents."
        },
        {
            "author": "The Siege of Gondor",
            "quote": "But soon there were few left in Minas Tirith who had the heart to stand up and defy the hosts of Mordor."
        },
        {
            "author": "The Siege of Gondor",
            "quote": "Slowly the great siege-towers built in Osgiliath rolled forward through the dark."
        },
        {
            "author": "Gandalf about Saruman, The White Rider",
            "quote": "'And all the time there is another danger, close at hand, which he does not see.... He has forgotten Treebeard.'"
        },
        {
            "author": "Merry, Flotsam and Jetsam",
            "quote": "'An angry Ent is terrifying. Their fingers, and their toes, just freeze on to rock; and they tear it up like bread-crust.'"
        },
        {
            "author": "Uglúk, The Uruk-hai",
            "quote": "'We are the servants of Saruman the Wise, the White Hand: the Hand that gives us man's-flesh to eat.'"
        },
        {
            "author": "The Road to Isengard",
            "quote": "...that vast fortress, armoury, prison, furnace of great power, Barad-dûr, the Dark Tower, which suffered no rival..."
        },
        {
            "author": "Éomer, Third Marshal, The Riders of Rohan",
            "quote": "'So suspecting what I most fear, a league between Orthanc and the Dark Tower, I led forth my éored men of my own household.'"
        },
        {
            "author": "Gandalf the White, The White Rider",
            "quote": "'But Isengard cannot fight Mordor, unless Saruman first obtains the Ring. That he will never do now. He does not yet know his peril.'"
        },
        {
            "author": "Merry to Aragorn, Flotsam and Jetsam",
            "quote": "'Saruman seems to have meant to finish off the king and all his men with one final blow. He emptied Isengard....'"
        },
        {
            "author": "Merry about Isengard's host, Flotsam and Jetsam",
            "quote": "'...endless lines of marching Orcs; and troops of them mounted on great wolves. And there were battalions of Men, too.'"
        },
        {
            "author": "Gandalf the White, The White Rider",
            "quote": "'A thing is about to happen which has not happened since the Elder Days: the Ents are going to wake up and find that they are strong.'"
        },
        {
            "author": "Helm's Deep",
            "quote": "Then the Orcs screamed, waving spear and sword, and shooting a cloud of arrows at any that stood revealed upon the battlements."
        },
        {
            "author": "Isengard's forces, Helm's Deep",
            "quote": "They wavered, broke, and fled back; and then charged again, broke and charged again; and each time, like the incoming sea, they halted at a higher point."
        },
        {
            "author": "Uglúk about Rohirrim, The Uruk-hai",
            "quote": "'No good trying to charge with them. They'd just squeal and bolt, and there are more than enough of these filthy horse-boys to mop up our lot on the flat.'"
        },
        {
            "author": "The Uruk-hai",
            "quote": "'We are the fighting Uruk-hai! We slew the great warrior.'"
        },
        {
            "author": "The Uruk-hai",
            "quote": "...there was Grishnákh again, and at his back a couple of score of others like him: long-armed crook-legged Orcs. They had a red eye painted on their shields."
        },
        {
            "author": "The Uruk-hai",
            "quote": "...Uglúk was overtaken and brought to bay at the very edge of Fangorn. There he was slain at last by Éomer, the Third Marshal of the Mark, who dismounted and fought him sword to sword."
        },
        {
            "author": "The Uruk-hai",
            "quote": "'Who does he think he is, setting up on his own with his filthy white badges? ... I Grishnákh say this: Saruman is a fool, and a dirty treacherous fool. But the Great Eye is on him.'"
        },
        {
            "author": "Helm's Deep",
            "quote": "'What of the dawn?' they jeered. 'We are the Uruk-hai... We come to kill, by sun or moon.'"
        },
        {
            "author": "Helm's Deep",
            "quote": "Grappling-hooks were hurled, and ladders raised. Again and again, the Orcs gained the summit of the outer wall, and again the defenders cast them down."
        },
        {
            "author": "The Ride of Eorl, Unfinished Tales",
            "quote": "'The Lady of the Golden Wood is on our side, it seems,' said Borondir."
        },
        {
            "author": "Uglúk of Isengard to Grishnák of Barad-dûr, The Uruk-hai",
            "quote": "'But unless you've got some guts for fighting, you've taken the wrong way. Lugbúrz was your road. The Whiteskins are coming.'"
        },
        {
            "author": "Aragorn, The Departure of Boromir",
            "quote": "'Here lie many that are not folk of Mordor. Some are from the North, from the Misty Mountains, if I know anything of Orcs...'"
        },
        {
            "author": "Aragorn, Flotsam and Jetsam",
            "quote": "'The Red Eye will be looking towards Isengard. But Saruman at any rate is in a cleft stick of his own cutting.'"
        },
        {
            "author": "The Departure of Boromir",
            "quote": "Boromir had blown his great horn till the woods rang, and at first the Orcs had been dismayed and had drawn back; but when no answer but the echoes came, they had attacked more fierce than ever."
        },
        {
            "author": "about the Orcs, The Departure of Boromir",
            "quote": "Then Boromir had come leaping through the trees. He had made them fight. He slew many of them and the rest fled."
        },
        {
            "author": "The Departure of Boromir",
            "quote": "...they were attacked again, by a hundred Orcs at least, some of them very large, and they shot a rain of arrows: always at Boromir."
        },
        {
            "author": "the Captain-General of Gondor, The Departure of Boromir",
            "quote": "'I tried to take the Ring from Frodo,' he said. 'I am sorry. I have paid.'"
        },
        {
            "author": "Gamling about the Dunlendings, Helm's Deep",
            "quote": "'They are fierce folk when roused. They will not give way now... until Théoden is taken, or they themselves are slain.'"
        },
        {
            "author": "Helm's Deep",
            "quote": "'Maybe, we have a thousand fit to fight on foot,' said Gamling... 'But most of them have seen too many winters, as I have, or too few, as my son's son here.'"
        },
        {
            "author": "to the Dunlendings, The Road to Isengard",
            "quote": "'Help now to repair the evil in which you have joined,' said Erkenbrand; 'and afterwards you shall take an oath never again to pass the Fords of Isen in arms, nor to march with the enemies of Men.'"
        },
        {
            "author": "The Great River",
            "quote": "'Yrch!' said Legolas, falling into his own tongue..."
        },
        {
            "author": "Unfinished Tales",
            "quote": "The Silvan Elves were hardy and valiant, but ill-equipped with armour or weapons in comparison with the Eldar of the West."
        },
        {
            "author": "Orcs fighting Isildur, Unfinished Tales",
            "quote": "They were silent now, and kept at a distance out of the range of the dreaded steelbows of Númenor."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "Then Gil-galad and Elendil passed into Mordor and encompassed the stronghold of Sauron; and they laid siege to it for seven years..."
        },
        {
            "author": "Gandalf, The Siege of Gondor",
            "quote": "'Fugitives from Cair Andros have already reached us. The isle has fallen. Another army comes from the Black Gate, crossing from the north-east.'"
        },
        {
            "author": "the War of the Dwarves and Orcs, Durin's Folk",
            "quote": "Both sides were pitiless, and there was death and cruel deeds...."
        },
        {
            "author": "the War of the Dwarves and Orcs, Durin's Folk",
            "quote": "When all was ready, they assailed and sacked one by one all the strongholds of the Orcs that they could from Gundabad to the Gladden."
        },
        {
            "author": "the War of the Dwarves and Orcs, Durin's Folk",
            "quote": "But a great host of foes was arrayed on the slopes above them, and out of the gates poured a multitude of Orcs that had been held back by Azog for the last need."
        },
        {
            "author": "the War of the Dwarves and Orcs, Durin's Folk",
            "quote": "Coming late and fresh to the field, the mailed warriors of Náin, Grór's son, drove through the Orcs to the very threshold of Moria, crying 'Azog! Azog!'"
        },
        {
            "author": "Azog of Moria to Náin the Dwarf, Durin's Folk",
            "quote": "'What? Yet another beggar at my doors? Must I brand you too?'"
        },
        {
            "author": "the Wainrider Militia, Unfinished Tales",
            "quote": "...their youths and old men were aided by the younger women, who in that people were also gained in arms and fought fiercely in defence of their homes and their children."
        },
        {
            "author": "The Field of Cormallen",
            "quote": "But the Men of Rhûn and of Harad, Easterling and Southron... were deepest and longest in evil servitude, hating the West, and yet were men proud and bold..."
        },
        {
            "author": "The Black Gate Opens",
            "quote": "Down from the hills on either side of the Morannon poured Orcs innumerable."
        },
        {
            "author": "Trolls, The Black Gate Opens",
            "quote": "Like a storm they broke upon the line of the Men of Gondor, and beat upon helm and head, and arm and shield as smiths hewing the hot bending iron."
        },
        {
            "author": "The Black Gate Opens",
            "quote": "The Orcs hindered by the mires that lay before the hills halted and poured their arrows into the defending ranks."
        },
        {
            "author": "Mount Doom",
            "quote": "...the Dark Lord had almost completed the movement of his forces, and even in the fastness of his own realm, he sought the secrecy of night..."
        },
        {
            "author": "The Peoples of Middle-earth",
            "quote": "Orcs again multiply in secret and occupy many deep places (especially those anciently made by the Dwarves) in the Misty Mountains."
        },
        {
            "author": "Gandalf, The Bridge of Khazad-dûm",
            "quote": "'There are Orcs, very many of them,' he said. 'And some are large and evil: black Uruks of Mordor.'"
        },
        {
            "author": "Gondor helps Arnor, Gondor and the Heirs of Anárion",
            "quote": "Most of all, the horses were praised, for many of them came from the Vales of Anduin, and with them were riders tall and fair, and proud princes of Rhovanion."
        },
        {
            "author": "Gondor and the Heirs of Anárion",
            "quote": "...an army of power, with munition and provision for a war of great kings. Or so it seemed to the people of the North, though this was but a small sending-force of the whole might of Gondor."
        },
        {
            "author": "The Bridge of Khazad-dûm",
            "quote": "...a rolling Boom that seemed to come from depths far below, and to tremble in the stone at their feet. They sprang towards the door in alarm. Doom, doom it rolled again..."
        },
        {
            "author": "Gondor's northern army, The House of Eorl",
            "quote": "Defeated in the Wold and cut off from the south... and was then suddenly assailed by the Orc-host that pressed it towards the Anduin."
        },
        {
            "author": "about Balchoth, Unfinished Tales",
            "quote": "But what they lacked in gear of war they made up in numbers, so far as could be guessed."
        },
        {
            "author": "Gondor and the Heirs of Anárion",
            "quote": "Eorl the Young came with his riders and swept away the enemy, and pursued the Balchoth to the death over the fields of Calenardhon."
        },
        {
            "author": "Of Herbs and Stewed Rabbit",
            "quote": "Rangers of Ithilien... were descended from folk who lived in Ithilien at one time, before it was overrun."
        },
        {
            "author": "Faramir, Captain of Gondor, The Window on the West",
            "quote": "'And we of Gondor grow like other Men, like the men of Rohan; for even they, who are the foes of the Dark Lord, shun the Elves and speak of the Golden Wood with dread.'"
        },
        {
            "author": "Gondor and the Heirs of Anárion",
            "quote": "Though war never ceased on their borders, for more than a thousand years the Dúnedain of the South grew in wealth and power by land and sea..."
        },
        {
            "author": "the Beornings, Many Meetings",
            "quote": "Grimbeorn the Old, son of Beorn, was now the lord of many sturdy men, and to their land between the Mountains and Mirkwood neither Orc nor wolf dared to go."
        },
        {
            "author": "about Lórien, The Tale of Years: The Third Age",
            "quote": "...but besides the valour of the Elven people of that land, the power that dwelt there was too great for any to overcome, unless Sauron had come there himself."
        },
        {
            "author": "Dol Guldur, The Tale of Years: The Third Age",
            "quote": "...and Galadriel threw down its walls and laid bare its pits, and the forest was cleansed."
        },
        {
            "author": "gifts to the Fellowship, Farewell to Lórien",
            "quote": "For each they had provided a hood and cloak, made according to his size, of the light but warm silken stuff that the Galadhrim wove."
        },
        {
            "author": "the Lady of Lórien to Sam, The Mirror of Galadriel",
            "quote": "'For this is what your folk would call magic, I believe... they seem also to use the same word of the deceits of the Enemy.'"
        },
        {
            "author": "the Lady of Lórien, The Mirror of Galadriel",
            "quote": "'I perceive the Dark Lord and know his mind, or all of his mind that concerns the Elves. And he gropes ever to see me and my thought. But still the door is closed!'"
        },
        {
            "author": "the Lady of Lórien, The Mirror of Galadriel",
            "quote": "'The love of the Elves for their land and their works is deeper than the deeps of the Sea... Yet they will cast all away rather than submit to Sauron: for they know him now.'"
        },
        {
            "author": "the Lady of Lórien, The Mirror of Galadriel",
            "quote": "'In place of the Dark Lord you will set up a Queen. And I shall not be dark, but beautiful and terrible as the Morning and the Night!... All shall love me and despair!'"
        },
        {
            "author": "Galadriel, Unfinished Tales",
            "quote": "...all that she had desired in her youth came to her hand, the Ring of Power and the dominion of Middle-earth which she had dreamed... Her wisdom was full grown and she rejected it..."
        },
        {
            "author": "The Breaking of the Fellowship",
            "quote": "Under the boughs of Mirkwood, there was deadly strife of Elves and Men and fell beasts."
        },
        {
            "author": "Gimli, The Passing of the Grey Company",
            "quote": "'Now why did not we wish for some of our own kinsfolk, Legolas?' 'They have no need to ride to war; war already marches on their own lands.'"
        },
        {
            "author": "Lothlórien",
            "quote": "'But there are some of us still who go abroad for the gathering of news and the watching of our enemies, and they speak the languages of other lands. I am one. Haldir is my name.'"
        },
        {
            "author": "Legolas about an Orc attack, The Council of Elrond",
            "quote": "'They were many and fierce, but they came from over the mountains, and were unused to the woods.'"
        },
        {
            "author": "in Mirkwood, The Hobbit",
            "quote": "In a great hall with pillars hewn out of the living stone sat the Elvenking on a chair of carved wood."
        },
        {
            "author": "Haldir the Marchwarden, Lothlórien",
            "quote": "'In the midst upon a stony height stands Dol Guldur, where long the hidden Enemy had his dwelling. We fear that now it is inhabited again, and with power sevenfold.'"
        },
        {
            "author": "about the Mouth of Sauron, The Black Gate Opens",
            "quote": "...and because of his cunning, he grew ever higher in the Lord's favour; and he learned great sorcery, and knew much of the mind of Sauron; and he was more cruel than any orc."
        },
        {
            "author": "The Mirror of Galadriel",
            "quote": "‘It was a Balrog of Morgoth,’ said Legolas; ‘of all Elf-banes the most deadly, save the One who sits in the Dark Tower.’"
        },
        {
            "author": "Legolas, retold by Gimli, The Last Debate",
            "quote": "'Up with your beard, Durin's son!' he said. 'For thus is it spoken: Oft hope is born, when all is forlorn.'"
        },
        {
            "author": "Gimli son of Glóin, The Last Debate",
            "quote": "'But men are better than gates, and no gate will endure against our Enemy if men desert it.'"
        },
        {
            "author": "Imrahil about the army of the West, The Last Debate",
            "quote": "'...this is the greatest jest in all the history of Gondor: that we should ride with seven thousands, scarce as many as the vanguard of its army in the days of its power...'"
        },
        {
            "author": "Gandalf the White, The Last Debate",
            "quote": "'And there are names among us that are worth more than a thousand mail-clad knights apiece.'"
        },
        {
            "author": "Legolas about Gondor, The Last Debate",
            "quote": "'...we came to Linhir... there men of Lamedon contested the fords with fell folk of Umbar and Harad who sailed up the river.'"
        },
        {
            "author": "Gorbag, captain of Cirith Ungol, The Choices of Master Samwise",
            "quote": "'...the enemies don't love us any more than they love Him, and if they get topside on Him, we're done too.'"
        },
        {
            "author": "Samwise Gamgee, gardener, The Choices of Master Samwise",
            "quote": "'Don't trust your head, Samwise, it is not the best part of you.'"
        },
        {
            "author": "The Black Gate Opens",
            "quote": "Dust arose smothering the air, as from nearby there marched up an army of Easterlings that had waited for the signal..."
        },
        {
            "author": "about an ambush, The Black Gate Opens",
            "quote": "But the Captains of the West were well warned by their scouts, skilled men from Henneth Annûn..."
        },
        {
            "author": "the Mouth of Sauron, The Black Gate Opens",
            "quote": "'These are the terms... The rabble of Gondor and its deluded allies shall withdraw at once... taking oaths never again to assail Sauron the Great in arms...'"
        },
        {
            "author": "the Tower of Cirith Ungol",
            "quote": "...the Tower of Cirith Ungol in all its strength. The horn that he had seen from the other side was only its topmost turret."
        },
        {
            "author": "Minas Tirith",
            "quote": "...the Guarded City, with its seven walls of stone so strong and old that it seemed to have been not build but carved by giants out of the bones of the earth."
        },
        {
            "author": "Théoden, The King of the Golden Hall",
            "quote": "'But in Dunharrow the people may long defend themselves, and if the battle go ill, thither will come to escape.'"
        },
        {
            "author": "Gandalf at Moria's gate, A Journey in the Dark",
            "quote": "'Those were happier days, when there was still close friendship at times between folk of different race, even between Dwarves and Elves.'"
        },
        {
            "author": "The Peoples of Middle-earth",
            "quote": "...the Isle of Tolfalas was almost destroyed, and was left at last like a barren and lonely mountain in the water not far from the issue of the River."
        },
        {
            "author": "Legolas shoots the fell beast, The Great River",
            "quote": "Suddenly the great bow of Lórien sang. Shrill went the arrow from the Elven-string."
        },
        {
            "author": "The White Rider",
            "quote": "'I am Gandalf, Gandalf the White, but Black is mightier still.'"
        },
        {
            "author": "The Tale of Years: The Third Age",
            "quote": "...Celeborn came forth and led the host of Lórien over Anduin in many boats. They took Dol Guldur..."
        },
        {
            "author": "an Orc army, Unfinished Tales",
            "quote": "Thranduil they had let pass, for even his diminished army was far too strong for them..."
        },
        {
            "author": "The Siege of Gondor",
            "quote": "The lines of fire became flowing torrents, file upon file of Orcs bearing flames, and wild Southron men with red banners, shouting with harsh tongues, surging up, overtaking the retreat."
        },
        {
            "author": "orderly retreat from Rammas Echor, The Siege of Gondor",
            "quote": "'Faramir must be there,' they said. 'He can govern man and beast. He will make it yet.'"
        },
        {
            "author": "Lothlórien",
            "quote": "'You are come to Cerin Amroth,' said Haldir. 'For this is the heart of the ancient realm as it was long ago...'"
        },
        {
            "author": "The Hobbit",
            "quote": "...the Orcs came down upon Erebor as soon as they heard of the return of the Dwarves; and they were led by Bolg, son of that Azog whom Dáin slew in his youth."
        },
        {
            "author": "fighting Goblins, The Hobbit",
            "quote": "...the assault from the Mountain was renewed with redoubled force, and upon either side men and elves were being slowly beaten down."
        },
        {
            "author": "The Hobbit",
            "quote": "A Goblin's head was stuck outside the gate and a Warg-skin was nailed to a tree just beyond. Beorn was a fierce enemy."
        },
        {
            "author": "Elrond about Thorin's company's swords, The Hobbit",
            "quote": "'They were made in Gondolin for the Goblin-wars. They must have come from a dragon's hoard or goblin plunder, for dragons and goblins destroyed that city many ages ago.'"
        },
        {
            "author": "King Eorl to Steward Cirion, Unfinished Tales",
            "quote": "'...the main force shall remain in the North-east to guard above all the place where the Balchoth made a crossing of the Anduin out of the Brown Lands.'"
        },
        {
            "author": "Aragorn, Of the Rings of Power and the Third Age",
            "quote": "...the Heir of Isildur arose in the North, and he took the shards of the sword of Elendil, and in Imladris they were reforged; and he went then to war, a great captain of Men."
        },
        {
            "author": "Sauron, Of the Rings of Power and the Third Age",
            "quote": "...and ere the Wise could prevent him he re-entered his kingdom in Mordor and reared once again the dark towers of Barad-dûr."
        },
        {
            "author": "about Saruman, Of the Rings of Power and the Third Age",
            "quote": "He gathered a great host of spies, and many of these were birds; for Radagast lent him his aid, divining naught of his treachery..."
        },
        {
            "author": "Helm's Deep",
            "quote": "But the Orcs laughed with loud voices; and a hail of darts and arrows whistled over the wall..."
        },
        {
            "author": "Gimli son of Glóin, The White Rider",
            "quote": "'Your bow, Legolas! Bend it! Get Ready! It is Saruman. Do not let him speak, or put a spell upon us! Shoot first!'"
        },
        {
            "author": "the Fellowship's flight, The Bridge of Khazad-dûm",
            "quote": "They did not halt until they were out of bowshot from the walls."
        },
        {
            "author": "Aragorn to Samwise, Lothlórien",
            "quote": "'Many have received worse than this in payment for the slaying of their first Orc. The cut is not poisoned, as the wounds of Orc-blades too often are.'"
        },
        {
            "author": "Gimli son of Glóin, Lothlórien",
            "quote": "'...Orcs will often pursue foes for many leagues into the plain, if they have a fallen captain to avenge.'"
        },
        {
            "author": "Legolas of the Woodland Realm, Lothlórien",
            "quote": "'...the Elves of Lórien... dwell in the trees, and maybe it is so still. Therefore they were called the Galadhrim, the Tree-people.'"
        },
        {
            "author": "Lothlórien",
            "quote": "'Yes, they are Elves', said Legolas; 'and they say that you breathe so loud that they could shoot you in the dark.'"
        },
        {
            "author": "Lothlórien",
            "quote": "'A dwarf!' said Haldir. 'That is not well. We have not had dealings with the Dwarves since the Dark Days. They are not permitted in our lands.'"
        },
        {
            "author": "Lothlórien",
            "quote": "A marching host of Elves had come up silently: they were hastening toward the northern borders to guard against any attack from Moria."
        },
        {
            "author": "Haldir the Marchwarden, Lothlórien",
            "quote": "'None of the Orcs will ever return out of Lórien. And there will be many Elves hidden on the northern border...'"
        },
        {
            "author": "Gandalf about Mithril, A Journey in the Dark",
            "quote": "'It could be beaten like copper, and polished like glass; and the Dwarves could make of it a metal, light and yet harder than tempered steel.'"
        },
        {
            "author": "The Riders of Rohan",
            "quote": "A thicket of spears were pointed towards the strangers; and some of the horsemen had bows in hand, and their arrows were already fitted to the string."
        },
        {
            "author": "The Riders of Rohan",
            "quote": "'I would cut off your head, beard and all, Master Dwarf, if it stood but a little higher from the ground' said Éomer."
        },
        {
            "author": "Gandalf, Minas Tirith",
            "quote": "'For not all the tidings that I bring are evil. But leave your trowels and sharpen your swords!'"
        },
        {
            "author": "Gwaihir, the Eagle, about Rohirrim, The Council of Elrond",
            "quote": "'But if Saruman has become evil, as you say, then their doom cannot be long delayed.'"
        },
        {
            "author": "Boromir of Gondor, The Council of Elrond",
            "quote": "'I know the Men of Rohan; true and valiant, our allies, dwelling still in the lands that we gave them long ago.'"
        },
        {
            "author": "The Breaking of the Fellowship",
            "quote": "The Misty Mountains were crawling like anthills; Orcs were issuing out of a thousand holes."
        },
        {
            "author": "The Breaking of the Fellowship",
            "quote": "The land of the Beornings was aflame; a cloud was over Moria; smoke rose on the borders of Lórien."
        },
        {
            "author": "The Breaking of the Fellowship",
            "quote": "From the havens of Harad, ships of war put out to sea."
        },
        {
            "author": "The Breaking of the Fellowship",
            "quote": "All the power of the Dark Lord was in motion."
        },
        {
            "author": "The Breaking of the Fellowship",
            "quote": "There was an eye in the Dark Tower that did not sleep."
        },
        {
            "author": "Chieftain of the Drúedain, The Ride of the Rohirrim",
            "quote": "'Kill gorgûn! Kill orc-folk! No other words please Wild Men' answered Ghân."
        },
        {
            "author": "The Ride of the Rohirrim",
            "quote": "'Alas!' said Théoden. 'Then Denethor has heard no news of our riding and will despair of our coming.'"
        },
        {
            "author": "The Ride of the Rohirrim",
            "quote": "'Need brooks no delay, yet late is better than never', said Éomer."
        },
        {
            "author": "The Ride of the Rohirrim",
            "quote": "And then all the host of Rohan burst into song, and they sang as they slew, for the joy of battle was on them..."
        },
        {
            "author": "Shagrat, Orc commander, The Tower of Cirith Ungol",
            "quote": "'Curse you Snaga, you little maggot! If you think I'm so damaged that it's safe to flout me, you're mistaken.'"
        },
        {
            "author": "Orc-driver to the disguised Sam and Frodo, The Land of Shadow",
            "quote": "'Where there's a whip there's a will, my slugs.'"
        },
        {
            "author": "the Mountains of Mordor, Mount Doom",
            "quote": "Yet still before it there stretched a wide region of fuming, barren, ash-ridden land."
        },
        {
            "author": "Samwise Gamgee, Mount Doom",
            "quote": "His will was set, and only death would break it."
        },
        {
            "author": "The Field of Cormallen",
            "quote": "The onslaught of Mordor broke like a wave on the beleaguered hills, voices roaring like a tide amid the wreck and crash of arms."
        },
        {
            "author": "Gimli son of Glóin, The Field of Cormallen",
            "quote": "'Mortals cannot go drinking ent-draughts and expect no more to come of them than a pot of beer.'"
        },
        {
            "author": "Aragorn to those who fear to assault Mordor, The Black Gate Opens",
            "quote": "'Take your way south-west till you come to Cair Andros, and if it is still held by enemies, as I think, then re-take it, if you can.'"
        },
        {
            "author": "Aragorn to those who fear to assault Mordor, The Black Gate Opens",
            "quote": "'...and hold Cair Andros to the last in defence of Gondor and Rohan!'"
        },
        {
            "author": "The Scouring of the Shire",
            "quote": "...Hobbits had crept out of the shadows. There was nearly two hundred of them, all holding some weapon."
        },
        {
            "author": "The leader of Saruman's ruffians, The Scouring of the Shire",
            "quote": "He aimed a savage blow at Merry who stood in his way. He fell dead with four arrows in him."
        },
        {
            "author": "Saruman's ruffians, The Scouring of the Shire",
            "quote": "...the Hobbits were obliged to shoot many of them or hew them with axes."
        },
        {
            "author": "Saruman to Frodo, The Scouring of the Shire",
            "quote": "'Yes, you have grown very much. You are wise, and cruel. You have robbed my revenge of sweetness...'"
        },
        {
            "author": "to Saruman, The Scouring of the Shire",
            "quote": "A look of wild hatred came into Wormtongue's red eyes. 'You told me to; you made me do it.'"
        },
        {
            "author": "Concerning Hobbits",
            "quote": "...the Battle of Greenfields, S.R. 1147, in which Bandobras Took routed an invasion of Orcs."
        },
        {
            "author": "Frodo sees Rangers of Ithilien, Of Herbs and Stewed Rabbit",
            "quote": "...he knew then that they must be Dúnedain of the South, men of the line of the Lords of Westernesse."
        },
        {
            "author": "Saruman to Gandalf, The Voice of Saruman",
            "quote": "'Later! Yes, when you also have the Keys of Barad-dûr itself, I suppose; and the crowns of seven kings; and the rods of the Five Wizards...'"
        },
        {
            "author": "Rhudaur, Annals of the Kings and Rulers",
            "quote": "...the Dúnedain were few, and power had been seized by an evil lord of the Hill-men, who was in secret league with Angmar."
        },
        {
            "author": "The Hobbit",
            "quote": "...there were still some people who had both Elves and heroes of the North for ancestors, and Elrond the master of the house was their chief."
        },
        {
            "author": "Elrond with his folk, Unfinished Tales",
            "quote": "He would indeed have been overwhelmed had not Sauron's host been attacked in the rear; for Durin sent out a force of Dwarves from Khazad-dûm..."
        },
        {
            "author": "after Eregion's fall, Of the Rings of Power and the Third Age",
            "quote": "In that time the stronghold and refuge of Imladris, that Men called Rivendell, was founded by Elrond Half-Elven; and long it endured."
        },
        {
            "author": "Gimli, The Voice of Saruman",
            "quote": "'In the language of Orthanc help means ruin, and saving means slaying, that is plain.'"
        },
        {
            "author": "Dernhelm, The Muster of Rohan",
            "quote": "...it was the face of one without hope who goes in search of death."
        },
        {
            "author": "Éowyn Shieldmaiden, The Battle of the Pelennor Fields",
            "quote": "Her eyes grey as the sea were hard and fell..."
        },
        {
            "author": "Gimli, The King of the Golden Hall",
            "quote": "'Men need many words before deeds. My axe is restless in my hands.'"
        },
        {
            "author": "about Dale, The Hobbit",
            "quote": "...there had been fleets of boats on the waters, and some were filled with gold and some with warriors in armour, and there had been wars and deeds which were now only a legend."
        },
        {
            "author": "Haradrim's Chieftain, The Battle of the Pelennor Fields",
            "quote": "Then he was filled with a red wrath and shouted aloud..."
        },
        {
            "author": "Legolas to Treebeard about Gimli, The Voice of Saruman",
            "quote": "'His axe is not for trees, but for orc necks...'"
        },
        {
            "author": "Faramir, Captain of Gondor, The Window on the West",
            "quote": "'It is not said that evil arts were ever practised in Gondor, or that the Nameless One was ever named in honour there.'"
        },
        {
            "author": "Pippin drinks Orc-draught, The Uruk-hai",
            "quote": "...he felt a hot fierce glow flow through him. The pain in his legs and ankles vanished."
        },
        {
            "author": "The Battle of the Pelennor Fields",
            "quote": "Horns were blown and trumpets were braying, and the Mûmakil were bellowing as they were goaded to war."
        },
        {
            "author": "The Siege of Gondor",
            "quote": "...and wild Southron men with red banners, shouting with harsh tongues, surging up, overtaking the retreat."
        },
        {
            "author": "Merry, The Uruk-hai",
            "quote": "'Lembas does put heart into you!'"
        },
        {
            "author": "about Haradrim, War of the Ring",
            "quote": "...grim folk, and not easily daunted by shade or blade."
        },
        {
            "author": "Unfinished Tales",
            "quote": "...the dreadful Orcish wolfriders, feared by horses."
        },
        {
            "author": "Unfinished Tales",
            "quote": "...fierce Uruks, heavily armed but trained to move at great speed for many miles."
        },
        {
            "author": "Barliman on evil men in Bree, Homeward Bound",
            "quote": "'And that was after we showed them the gates and pushed them out...'"
        },
        {
            "author": "Barliman about Bree, Homeward Bound",
            "quote": "'Why, we had a real set-to, and there were some folk killed, killed dead!'"
        },
        {
            "author": "Théoden about Erkenbrand, Helm's Deep",
            "quote": "'He was a mighty man. In him lived again the valour of Helm the Hammerhand.'"
        },
        {
            "author": "Erkenbrand at the Hornburg, Helm's Deep",
            "quote": "As the days darkened with threat of war, being wise, he had repaired the wall and made the fastness strong."
        },
        {
            "author": "Erkenbrand, Lord of Westfold, Helm's Deep",
            "quote": "Amid them strode a man tall and strong. His shield was red. As he came to the valley's brink, he set to his lips a great black horn and blew a ringing blast."
        },
        {
            "author": "Unfinished Tales; The Battles of the Fords of Isen",
            "quote": "...Rohirrim charged the enemy to the north and south of the camp... Grimbold himself remained on foot with a rearguard of picked men..."
        },
        {
            "author": "about Isengard's forces, Unfinished Tales",
            "quote": "A great company of bowmen might have made them rue the light of their torches, but Grimbold had only a handful of archers."
        },
        {
            "author": "Rohan's Shieldwall, Unfinished Tales; The Battles of the Fords of Isen",
            "quote": "...since the Orcs were of less avail in such fighting because of their stature, fierce companies of the Dunlendish hillmen were thrown against Rohan's shieldwall."
        },
        {
            "author": "Unfinished Tales; The Battles of the Fords of Isen",
            "quote": "...any man that could break out and escape southwards would be more useful, though he might seem inglorious."
        },
        {
            "author": "Gandalf the Grey, The Council of Elrond",
            "quote": "'...things are now moving which will require the union of all our strength.'"
        },
        {
            "author": "Annals of the Kings and Rulers",
            "quote": "These Balchoth were constantly increased by others of like kind that came in from the east..."
        },
        {
            "author": "Gandalf the Grey, The Council of Elrond",
            "quote": "'Wolves and Orcs were housed in Isengard, for Saruman was mustering a great force on his own account...'"
        },
        {
            "author": "Gandalf about Isengard, The Council of Elrond",
            "quote": "'I looked on it and saw that, whereas it had once been green and fair, it was now filled with pits and forges.'"
        },
        {
            "author": "Pippin to Hob, The Scouring of the Shire",
            "quote": "'Well now, what about a smoke, while you tell us what has been happening in the Shire?'"
        },
        {
            "author": "Legolas, The Two Towers",
            "quote": "'They are taking the Hobbits to Isengard!'"
        },
        {
            "author": "Gandalf, The Bridge of Khazad-dûm",
            "quote": "'So ended the attempt to retake Moria!'"
        },
        {
            "author": "The Bridge of Khazad-dûm",
            "quote": "There was a horn-blast and a rush of feet, and Orcs one after another leaped into the chamber."
        },
        {
            "author": "Gandalf, The Bridge of Khazad-dûm",
            "quote": "'Let us go, before the troll returns!'"
        },
        {
            "author": "The Bridge of Khazad-dûm",
            "quote": "...a huge Orc-chieftain, almost man-high, clad in black mail from head to foot, leaped into the chamber..."
        },
        {
            "author": "The Hobbit",
            "quote": "Ever since the fall of the Great Goblin of the Misty Mountains, the hatred of their race for the Dwarves had been rekindled to fury."
        },
        {
            "author": "a Troll, The Bridge of Khazad-dûm",
            "quote": "Boromir leaped forward and hewed at the arm with all his might; but his sword rang, glanced aside, and fell from his shaken hand."
        },
        {
            "author": "The Departure of Boromir",
            "quote": "His horn cloven in two was at his side. Many Orcs lay slain, piled all about him and at his feet."
        },
        {
            "author": "the Balrog, The Bridge of Khazad-dûm",
            "quote": "...and a power and terror seemed to be in it and to go before it."
        },
        {
            "author": "Gandalf, Of the Rings of Power and the Third Age",
            "quote": "'It is Sauron himself who has taken shape again and now grows apace.'"
        },
        {
            "author": "Gandalf about Sauron, Unfinished Tales",
            "quote": "'...I... persuaded the Council to attack Dol Guldur first, before he attacked Lórien.'"
        },
        {
            "author": "Gandalf about Sauron, Unfinished Tales",
            "quote": "'...to attack Lórien and Rivendell, as soon as he was strong enough was his original plan.'"
        },
        {
            "author": "Aragorn, Strider",
            "quote": "'Well, I have rather a rascally look, have I not?'"
        },
        {
            "author": "Aragorn, The Departure of Boromir",
            "quote": "'The Orcs in the service of the Barad-dûr use the sign of the Red Eye.'"
        },
        {
            "author": "Frodo Baggins, Of Herbs and Stewed Rabbit",
            "quote": "'...I am a friend of all enemies of the One Enemy.'"
        },
        {
            "author": "Of Herbs and Stewed Rabbit",
            "quote": "It was Sam's first view of a battle of Men against Men, and he did not like it much."
        },
        {
            "author": "Sam wondering about a Haradrim, Of Herbs and Stewed Rabbit",
            "quote": "...if he really was evil of hearth, or what lies or threats had led him on the long march from his home."
        },
        {
            "author": "Faramir, The Window on the West",
            "quote": "'It is long since we had any hope.'"
        },
        {
            "author": "Faramir, The Window on the West",
            "quote": "'For as the Rohirrim do, we now love war and valour as things good in themselves...'"
        },
        {
            "author": "Faramir, The Window on the West",
            "quote": "'Men now fear and misdoubt the Elves...'"
        },
        {
            "author": "Beregond, Citadel Guard, Minas Tirith",
            "quote": "'...a man of arms of the Guard of the Tower of Gondor is held worthy in the City...'"
        },
        {
            "author": "Minas Tirith",
            "quote": "...the Guards of the Citadel before the Court of the Fountain where the White Tree once had grown."
        },
        {
            "author": "Gandalf the White, Minas Tirith",
            "quote": "'Hail, Lord and Steward of Minas Tirith, Denethor son of Ecthelion!'"
        },
        {
            "author": "Steward Denethor II, Minas Tirith",
            "quote": "'But I know already sufficient of these deeds for my own counsel against the menace of the East.'"
        },
        {
            "author": "Steward Denethor II, Minas Tirith",
            "quote": "'Pride would be folly that disdained help and counsel at need.'"
        },
        {
            "author": "The Battle of the Pelennor Fields",
            "quote": "The axes hewed Forlong as he fought alone and unhorsed."
        },
        {
            "author": "Morgul Vale, The Stairs of Cirith Ungol",
            "quote": "So great an army had never issued from that vale since the days of Isildur's might... and yet it was but one and not the greatest of the hosts that Mordor now sent forth."
        },
        {
            "author": "the Steward of Gondor, The Pyre of Denethor",
            "quote": "'Go forth and fight! Vanity. For a little space you may triumph on the field, for a day.'"
        },
        {
            "author": "Beregond, Citadel Guard, Minas Tirith",
            "quote": "'This is a great war long-planned, and we are but one piece in it, whatever pride may say.'"
        },
        {
            "author": "Denethor II about the Ring, The Siege of Gondor",
            "quote": "'The Enemy has found it, and now his power waxes; he sees our very thoughts, and all we do is ruinous.'"
        },
        {
            "author": "the Steward of Gondor, The Pyre of Denethor",
            "quote": "'All the East is moving.'"
        },
        {
            "author": "The Siege of Gondor",
            "quote": "The field was strewn with stricken Orcs and Men, and a reek arose of torches cast away, sputtering out in swirling smoke."
        },
        {
            "author": "Ingold, commander of Gondor, The Siege of Gondor",
            "quote": "'They are strong: battalions of Orcs of the Eye, and countless companies of Men of a new sort that we have not met before.'"
        },
        {
            "author": "Gandalf the White, Minas Tirith",
            "quote": "'Courage will now be your best defence against the storm that is at hand...'"
        },
        {
            "author": "The Siege of Gondor",
            "quote": "Far above a great cloud streamed slowly westward from the Black Land, devouring light, borne upon a wind of war."
        },
        {
            "author": "clouds from Mordor, The Muster of Rohan",
            "quote": "All the lands were grey and still; and ever the shadow deepened before them, and hope waned in every heart."
        },
        {
            "author": "the Host, The Council of Elrond",
            "quote": "'I beheld the last combat on the slopes of Orodruin, where Gil-galad died, and Elendil fell, and Narsil broke beneath him...'"
        },
        {
            "author": "The Peoples of Middle-earth",
            "quote": "The new realms of Arnor and Gondor lasted about 110 years before Sauron made his first attacks on them."
        },
        {
            "author": "Of the Rings of Power and the Third Age",
            "quote": "But Sauron also was thrown down, and with the hilt-shard of Narsil, Isildur cut the Ruling Ring from the hand of Sauron and took it for his own."
        },
        {
            "author": "about the Pelennor wall, Minas Tirith",
            "quote": "...Rammas Echor... men of Gondor called the out wall that they had built with great labour, after Ithilien fell under the shadow of their Enemy."
        },
        {
            "author": "The House of Eorl: The Kings of the Mark",
            "quote": "Orcs began to raid in the eastern regions and slay or steal horses."
        },
        {
            "author": "The Land of Shadow",
            "quote": "...and there now their Lord was gathering in haste great forces to meet the onslaught of the Captains of the West."
        },
        {
            "author": "Gorgoroth in Mordor, The Land of Shadow",
            "quote": "Here in the northward regions were the mines and forges, and the musterings of long-planned war."
        },
        {
            "author": "Rangers meet the Black Riders, Unfinished Tales",
            "quote": "Some fled northward, hoping to bear news to Aragorn, but they were pursued and slain or driven away into the wild."
        },
        {
            "author": "Aragorn, The Last Debate",
            "quote": "'Four thousands I sent marching from Pelargir through Lossarnach two days ago.'"
        },
        {
            "author": "soldiers of Gondor, The Siege of Gondor",
            "quote": "'While we yet live? How long? He has a weapon that has brought low many strong places since the world began. Hunger.'"
        },
        {
            "author": "Théoden about a Mordor army, The Ride of the Rohirrim",
            "quote": "'And our scouts say that they have cast trenches and stakes across the road. We cannot sweep them away in sudden onset.'"
        },
        {
            "author": "The Ride of the Rohirrim",
            "quote": "Orcs were roving in the hills and woods along the roadside."
        },
        {
            "author": "Gandalf the White, Minas Tirith",
            "quote": "'The beacons of Gondor are alight, calling for aid. War is kindled.'"
        },
        {
            "author": "Aragorn, The Ring Goes South",
            "quote": "'They are not natives here; they are crebain out of Fangorn and Dunland... I think they are spying out the land.'"
        },
        {
            "author": "Nazgûl's Morgul blades, A Knife in the Dark",
            "quote": "...both the knife and the hand that held it glowed with a pale light."
        },
        {
            "author": "Warg Riders, The Hobbit",
            "quote": "Ere long the vanguard swirled round the spur's end and came rushing into Dale."
        },
        {
            "author": "The Hobbit",
            "quote": "Already a host of the Elves is on the way, and carrion birds are with them hoping for battle and slaughter."
        },
        {
            "author": "The Army of Laketown, The Hobbit",
            "quote": "So it was that Bard's messengers found him now marching with many spearmen and bowmen."
        },
        {
            "author": "Roäc, Chieftain of the Ravens, The Hobbit",
            "quote": "'We would see peace once more among Dwarves and Men and Elves after the long desolation.'"
        },
        {
            "author": "Bilbo Baggins, The Hobbit",
            "quote": "'Dáin, I may tell you, is now less than two days' march off, and has at least five hundred grim Dwarves with him..."
        },
        {
            "author": "Bilbo about Dáin's Dwarven Warriors, The Hobbit",
            "quote": "'...a good many of them have had experience in the dreadful Dwarf and Goblin wars, of which you have no doubt heard.'"
        },
        {
            "author": "Dáin's warriors, The Hobbit",
            "quote": "Their caps where of iron and they were shod with iron and their faces were grim."
        },
        {
            "author": "Dáin's warriors, The Hobbit",
            "quote": "In battle they wielded heavy two-handed mattocks; but each of them had also a short sword and a round shield slung on his back."
        },
        {
            "author": "the Orcs of the Misty Mountains, The Hobbit",
            "quote": "Their banners were countless, black and red, and they came on like a tide in fury and disorder."
        },
        {
            "author": "The Hobbit",
            "quote": "The Elves were the first to charge. Their hatred for the Goblins is cold and bitter."
        },
        {
            "author": "the Silvan Elves, The Hobbit",
            "quote": "Their spears and swords shone in the gloom with a gleam of chill flame, so deadly was the wrath of the hands that held them."
        },
        {
            "author": "the Silvan Elves, The Hobbit",
            "quote": "Behind the arrows a thousand of their spearmen leapt down and charged."
        },
        {
            "author": "the Silvan Elves, The Hobbit",
            "quote": "As soon as the host of their enemies was dense in the valley, they sent against it a shower of arrows, and each flickered as it fled as if with stinging fire."
        },
        {
            "author": "the Easterlings, Unfinished Tales",
            "quote": "Cruel wars raged among them, from which some were withdrawing west­ward, with minds filled with hatred, regarding all that dwelt in the West as enemies to be slain and plundered."
        },
        {
            "author": "about Beorn, The Hobbit",
            "quote": "He scattered the bodyguard and pulled down Bolg himself and crushed him. The dismay fell on the Goblins and they fled in all directions."
        },
        {
            "author": "Bilbo's goodbye to the Dwarves, The Hobbit",
            "quote": "'May your beard never grow thin!'"
        },
        {
            "author": "Treebeard, Many Partings",
            "quote": "'For the world is changing: I feel it in the water, I feel it in the earth, and I smell it in the air.'"
        },
        {
            "author": "The Hobbit",
            "quote": "Bard had rebuilt the town in Dale and men had gathered to him from the Lake and from South and West..."
        },
        {
            "author": "Pippin about fighting the Shadow, Minas Tirith",
            "quote": "'We may stand, if only on one leg, or at least be left still upon our knees.'"
        },
        {
            "author": "The Siege of Gondor",
            "quote": "...the air was still and breathless, as if all the Vale of Anduin waited for the onset of a ruinous storm."
        },
        {
            "author": "Pippin about Faramir, The Siege of Gondor",
            "quote": "He was a captain that men would follow, that he would follow, even under the shadow of the black wings."
        },
        {
            "author": "Faramir, The Siege of Gondor",
            "quote": "'Yestereve I lay at Cair Andros, the long isle in the River northward which we hold in defence; and horses are kept on the hither bank.'"
        },
        {
            "author": "Steward Denethor II, The Siege of Gondor",
            "quote": "'And where will other men look for help, if Gondor falls?'"
        },
        {
            "author": "Gandalf, The Siege of Gondor",
            "quote": "'There are evil days ahead.'"
        },
        {
            "author": "Denethor about Sauron, The Siege of Gondor",
            "quote": "'He uses others as his weapons. So do all great lords, if they are wise...'"
        },
        {
            "author": "Saruman, Many Partings",
            "quote": "'Still, a beggar must be grateful, if a thief returns him even a morsel of his own.'"
        },
        {
            "author": "Gandalf about Sauron, The Pyre of Denethor",
            "quote": "'Such deeds he loves; friend at war with friend; loyalty divided in confusion of hearts.'"
        },
        {
            "author": "the Silvan Elves, The Hobbit",
            "quote": "They differed from the High Elves of the West, and were more dangerous and less wise."
        },
        {
            "author": "the Silvan Elves, The Hobbit",
            "quote": "Though their magic was strong, even in those days they were wary."
        },
        {
            "author": "Gandalf, The Hobbit",
            "quote": "'...round Mirkwood in the North you would be right among the slopes of the Grey Mountains, and they are simply stiff with Goblins...'"
        },
        {
            "author": "The Hobbit",
            "quote": "...the glint of the moon on goblin spears and helmets, as long lines of the wicked folk crept down the hillside from their gate..."
        },
        {
            "author": "the Lord of the Eagles, The Hobbit",
            "quote": "'I hear wolves voices! Are the Goblin's at mischief in the woods?'"
        },
        {
            "author": "The Hobbit",
            "quote": "...the Goblins had spread in secret after the battle of the Mines of Moria."
        },
        {
            "author": "Gandalf about Sauron, The Hobbit",
            "quote": "'He is an enemy quite beyond the powers of all the Dwarves put together...'"
        },
        {
            "author": "Bandobras Took, The Hobbit",
            "quote": "He charged the ranks of the Goblins of Mount Gram in the Battle of the Green Fields and knocked their king Golfimbuls head clean off with a wooden club."
        },
        {
            "author": "The Hobbit",
            "quote": "...with them came the bodyguard of Bolg, Goblins of huge size with scimitars of steel."
        },
        {
            "author": "Gandalf about Sauron, The White Rider",
            "quote": "'That we should wish to cast him down and have no one in his place is not a thought that occurs to his mind.'"
        },
        {
            "author": "Gandalf about the Balrog, The White Rider",
            "quote": "'Long I fell, and he fell with me... We fought far under the living earth, where time is not counted.'"
        },
        {
            "author": "Unfinished Tales; The Palantíri",
            "quote": "If the Steward thought of the Stone when he gave Orthanc to Saruman, he probably thought that it could be in no safer hands than those of the head of the Council opposed to Sauron."
        },
        {
            "author": "Unfinished Tales; The Palantíri",
            "quote": "It was Sauron who made them sinister, and instruments of domination and deceit."
        },
        {
            "author": "The Nazgûl, Unfinished Tales",
            "quote": "...they came to Sarn Ford and the southernmost borders of the Shire. They found them guarded for the Rangers barred their way."
        },
        {
            "author": "The Hobbit",
            "quote": "These were the swiftest wolf-riders, and already their cries and howls rent the air afar."
        },
        {
            "author": "about Sauron's palantír, Unfinished Tales",
            "quote": "It was not his way to commit such instruments to the use of subordinates; nor had he any servant whose mental power were superior to Saruman's or even Denethor's."
        },
        {
            "author": "Gandalf, The Hobbit",
            "quote": "'As I was saying I met two of Elrond's people. They were hurrying along for fear of the trolls.'"
        },
        {
            "author": "2510 TA, Unfinished Tales",
            "quote": "In the days of Cirion the Steward, there came a great assault by the Balchoth, who allied with Orcs crossed the Anduin into the Wold..."
        },
        {
            "author": "Gimli about Pelargir, The Last Debate",
            "quote": "'But the Haradrim, being now driven to the brink, turned at bay, and they were fierce in despair.'"
        },
        {
            "author": "Gimli about Haradrim, The Last Debate",
            "quote": "'Reckless we rode among our fleeing foes, driving them like leaves, until we came to the shore.'"
        },
        {
            "author": "Legolas Greenleaf, The Last Debate",
            "quote": "'...I looked on Aragorn and thought how great and terrible a Lord he might have become in the strength of his will, had he taken the Ring to himself.'"
        },
        {
            "author": "Gimli about Pelargir, The Last Debate",
            "quote": "'...away in the North we saw a red glow under the cloud, and Aragorn said: \"Minas Tirith is burning.\"'"
        },
        {
            "author": "Gimli son of Glóin, The Last Debate",
            "quote": "'Yet whatever is still to do, I hope to have a part in it, for the honour of the folk of the Lonely Mountain.'"
        },
        {
            "author": "Imrahil and Éomer, The Last Debate",
            "quote": "And there they took counsel together with Gandalf and Aragorn and the sons of Elrond."
        },
        {
            "author": "Gandalf about Denethor's knowledge, The Last Debate",
            "quote": "'The Stones of Seeing do not lie, and not even the Lord of Barad-dûr can make them do so.'"
        },
        {
            "author": "Gandalf about Denethor's Palantír, The Last Debate",
            "quote": "'Nonetheless it cannot be doubted that when Denethor saw great forces arrayed against him in Mordor, and more still being gathered, he saw that which truly is.'"
        },
        {
            "author": "Gandalf about Gondor and Rohan, The Last Debate",
            "quote": "'Hardly has our strength sufficed to beat off the first great assault. The next will be greater.'"
        },
        {
            "author": "The Black Gate Opens",
            "quote": "The host of Orcs and Easterlings had turned back out of Anórien, but harried and scattered by the Rohirrim they had broken and fled with little fighting towards Cair Andros."
        },
        {
            "author": "Gildor Inglorion of the House of Finrod, Three is Company",
            "quote": "'Courage is found in unlikely places.'"
        },
        {
            "author": "Frodo, A Conspiracy Unmasked",
            "quote": "'There is a connexion with Bilbo's old adventures, and the Riders are looking, or perhaps one ought to say searching, for him or for me.'"
        },
        {
            "author": "Bombadil about Arnor, Fog on the Barrow-Downs",
            "quote": "...they were foes of the Dark Lord, but they were overcome by the Evil King of Carn Dûm in the Land of Angmar."
        },
        {
            "author": "Bombadil about Dúnedain, Fog on the Barrow-Downs",
            "quote": "'...yet still some go wandering, sons of forgotten kings walking in loneliness, guarding from evil things folk that are heedless.'"
        },
        {
            "author": "At the Sign of the Prancing Pony",
            "quote": "The Men of Bree were brown-haired, broad, and rather short, cheerful and independent: they belonged to nobody but themselves."
        },
        {
            "author": "Dúnedain, At the Sign of the Prancing Pony",
            "quote": "The Bree-folk called them Rangers, and knew nothing of their origin."
        },
        {
            "author": "Gondor and the Heirs of Anárion",
            "quote": "Umbar remained at war with Gondor for many lives of men, a threat to its coastlands and to all traffic on the sea."
        },
        {
            "author": "Gondor and the Heirs of Anárion",
            "quote": "...and the region of South Gondor became a debatable land between the Corsairs and the Kings."
        },
        {
            "author": "Gondor and the Heirs of Anárion",
            "quote": "...Eldacar showed favour to the Northmen... and the people of Gondor were replenished by great numbers that came from Rhovanion."
        },
        {
            "author": "Gondor and Arnor, Gondor and the Heirs of Anárion",
            "quote": "For at last they perceived that some single power and will was directing the assault from many quarters upon the survivors of Númenor."
        },
        {
            "author": "Glorfindel about the Witch-king, Gondor and the Heirs of Anárion",
            "quote": "'Far off yet is his doom, and not by the hand of man will he fall.'"
        },
        {
            "author": "Gondor and the Heirs of Anárion",
            "quote": "Three great fleets, long prepared, came up from Umbar and the Harad, and assailed the coasts of Gondor in great force."
        },
        {
            "author": "Gondor and the Heirs of Anárion",
            "quote": "It was Túrin that built secret refuges for his soldiers in Ithilien, of which Henneth Annûn was the longest guarded and manned."
        },
        {
            "author": "Steward Denethor II's grandfather, Gondor and the Heirs of Anárion",
            "quote": "But his chief peril lay in the south, where the Haradrim had occupied South Gondor, and there was much fighting along the Poros."
        },
        {
            "author": "Gondor and the Heirs of Anárion",
            "quote": "Then the Barad-dûr was raised once more, and Mount Doom burst into flame, and the last of the folk of Ithilien fled far away."
        },
        {
            "author": "Denethor and Aragorn, Gondor and the Heirs of Anárion",
            "quote": "Indeed he was as like to Thorongil as to one of nearest kin..."
        },
        {
            "author": "Gondor and the Heirs of Anárion",
            "quote": "...for the Stone of Minas Tirith was the Palantír of Anárion, most close in accord with the one that Sauron possessed."
        },
        {
            "author": "Elrond to Aragorn, The Tale of Aragorn and Arwen",
            "quote": "'Here is the ring of Barahir,' he said, 'the token of our kinship from afar.'"
        },
        {
            "author": "Arwen, The Tale of Aragorn and Arwen",
            "quote": "'I have dwelt for a time in the land of my mother's kin, in far Lothlórien.'"
        },
        {
            "author": "The Tale of Aragorn and Arwen",
            "quote": "He rode in the host of the Rohirrim, and fought for the Lord of Gondor by land and by sea."
        },
        {
            "author": "Elrond's demand, The Tale of Aragorn and Arwen",
            "quote": "'She shall not be the bride of any Man less than the King of both Gondor and Arnor.'"
        },
        {
            "author": "Gilraen, his mother, The Tale of Aragorn and Arwen",
            "quote": "'I gave Hope to the Dúnedain, I have kept no hope for myself.'"
        },
        {
            "author": "Erebor, Durin's Folk",
            "quote": "For they made not only things of wonder and beauty but weapons and armour of great worth."
        },
        {
            "author": "Orcs about killing Thrór in Moria, Durin's Folk",
            "quote": "'If any of your people poke their foul beards in here again, they will fare the same.'"
        },
        {
            "author": "Durin's Folk",
            "quote": "That was the beginning of the War of the Dwarves and the Orcs, which was long and deadly, and fought for the most part in deep places beneath the earth."
        },
        {
            "author": "the war against the Orcs, Durin's Folk",
            "quote": "Durin's Folk gathered all their host, and they were joined by great forces sent from the Houses of other Fathers."
        },
        {
            "author": "Durin's Folk",
            "quote": "...Orcs that fled before them were gathered in Moria, and the Dwarf-host in pursuit came to Azanulbizar."
        },
        {
            "author": "the Orc chieftain Azog, Durin's Folk",
            "quote": "For he saw that all his host in the valley was in a rout, and the Dwarves went this way and that slaying as they would..."
        },
        {
            "author": "Thorin Oakenshield settles, Durin's Folk",
            "quote": "'The hammer will at least keep the arms strong, until they can wield sharper tools again.'"
        },
        {
            "author": "Durin's Ring, Durin's Folk",
            "quote": "...they say that it was given to the King of Khazad-dûm, Durin III, by the Elven-smiths themselves and not by Sauron..."
        },
        {
            "author": "Dwarves with Rings, Durin's Folk",
            "quote": "Though they could be slain or broken, they could not be reduced to shadows enslaved to another will."
        },
        {
            "author": "Orcs, The Languages and Peoples of the Third Age",
            "quote": "It is said that they had no language of their own, but took what they could of other tongues and perverted it to their own liking."
        },
        {
            "author": "The Languages and Peoples of the Third Age",
            "quote": "Trolls therefore took such language as they could master from the Orcs."
        },
        {
            "author": "Concerning Dwarves",
            "quote": "But in the Third Age close friendship still was found in many places between Men and Dwarves."
        },
        {
            "author": "The Dwarves, The Hobbit",
            "quote": "For some Elves tease them and laugh at them, and most of all at their beards."
        },
        {
            "author": "Elrond about Orcrist, The Hobbit",
            "quote": "'May it soon cleave Goblins once again!'"
        },
        {
            "author": "inside the Misty Mountains, The Hobbit",
            "quote": "It was deep, deep, dark, such as only Goblins that have taken to living in the heart of the mountains can see through."
        },
        {
            "author": "Goblins, The Hobbit",
            "quote": "They can tunnel and mine as well as any but the most skilled Dwarves, when they take the trouble, though they are usually untidy and dirty."
        },
        {
            "author": "Goblins, The Hobbit",
            "quote": "Hammers, axes, swords, daggers, pickaxes, tongs, and also instruments of torture, they make very well, or get other people to make to their design, prisoners and slaves..."
        },
        {
            "author": "Goblins, The Hobbit",
            "quote": "...in some parts, wicked Dwarves had even made alliances with them. But they had a special grudge against Thorin's people, because of the war which you have heard mentioned..."
        },
        {
            "author": "Thorin's sword Orcrist, The Hobbit",
            "quote": "It had killed hundreds of Goblins in its time, when the fair elves of Gondolin hunted them in the hills or did battle before their walls."
        },
        {
            "author": "Bilbo with Sting, The Hobbit",
            "quote": "It was rather splendid to be wearing a blade made in Gondolin for the Goblin-wars of which so many songs had sung."
        },
        {
            "author": "Gollum used the Ring, The Hobbit",
            "quote": "Only a few hours ago he had worn it, and caught a small Goblin-imp. How it squeaked! He still had a bone or two left to gnaw, but he wanted something softer."
        },
        {
            "author": "Dori the Dwarf, The Hobbit",
            "quote": "'Goblins fighting and biting in the dark, everybody falling over bodies and hitting one another!'"
        },
        {
            "author": "The Hobbit",
            "quote": "Even magic rings are not much use against wolves - especially against the evil packs that lived under the shadow of the Goblin-infested mountains."
        },
        {
            "author": "Wargs, The Hobbit",
            "quote": "These they guarded too, while all the rest (hundreds and hundreds it seemed) went and sat in a great circle in the glade."
        },
        {
            "author": "The Hobbit",
            "quote": "Now it seemed that a great Goblin-raid had been planned for that very night."
        },
        {
            "author": "Gandalf to Beorn, The Hobbit",
            "quote": "'I have heard of you, if you have not heard of me; but perhaps you have heard of my good cousin Radagast who lives near the Southern borders of Mirkwood?'"
        },
        {
            "author": "Bard of Lake Town, The Hobbit",
            "quote": "Now he shot with a great yew bow, till all his arrows but one were spent."
        },
        {
            "author": "Bard the Bowman, The Hobbit",
            "quote": "He thought of the Master's words, and of Dale rebuilt, and filled with golden bells, if he could but find the men."
        },
        {
            "author": "Lake Town, The Hobbit",
            "quote": "But all the men of arms who were still able, and the most of the Elvenking's array, got ready to march north to the Mountain."
        },
        {
            "author": "Erebor, The Hobbit",
            "quote": "So now they began to labour hard in fortifying the main entrance, and in remaking the road that led from it."
        },
        {
            "author": "about the Lake-men and Silvans, The Hobbit",
            "quote": "'They have come!' called Balin. 'And their camp is very great.'"
        },
        {
            "author": "Bard the Bowman, The Hobbit",
            "quote": "'Moreover the wealthy may have pity beyond right on the needy that befriended them when they were in want.'"
        },
        {
            "author": "the Arkenstone, The Hobbit",
            "quote": "The Elvenking himself, whose eyes were used to things of wonder and beauty, stood up in amazement."
        },
        {
            "author": "Dáin's warriors, The Hobbit",
            "quote": "The Dwarves are exceedingly strong for their height, but most of these were strong even for Dwarves."
        },
        {
            "author": "Dáin's warriors to the Lake-men and Silvans, The Hobbit",
            "quote": "'You have no business here. We are going on, so make way or we shall fight you!'"
        },
        {
            "author": "Thranduil, The Hobbit",
            "quote": "'Long will I tarry, ere I begin this war for gold.'"
        },
        {
            "author": "Bard about Dwarves, The Hobbit",
            "quote": "'They do not understand war above ground, whatever they may know of battle in the mines.'"
        },
        {
            "author": "Bard to Thranduil, The hobbit",
            "quote": "'There are many of our archers and spearmen now hidden in the rocks upon their right flank.'"
        },
        {
            "author": "Silvans charge, The Hobbit",
            "quote": "The yells were deafening. The rocks were stained black with goblin blood."
        },
        {
            "author": "Dwarves of the Iron Hills, The Hobbit",
            "quote": "...and beside them came the men of the Lake with long swords."
        },
        {
            "author": "Goblin reinforcement appears, The Hobbit",
            "quote": "Victory now vanished from hope. They had only stemmed the first onslaught of the black tide."
        },
        {
            "author": "Thorin Oakenshield charges, The Hobbit",
            "quote": "'To me! To me! Elves and Men! To me! O my kinsfolk!' he cried, and his voice shook like a horn in the valley."
        },
        {
            "author": "The Hobbit",
            "quote": "Once again, the Goblins were stricken in the valley; and they were piled in heaps till Dale was dark and hideous with their corpses."
        },
        {
            "author": "Bilbo in battle, The Hobbit",
            "quote": "'I have heard songs of many battles, and I have always understood that defeat may be glorious. It seems very uncomfortable, not to say distressing.'"
        },
        {
            "author": "Thorin II Oakenshield, The Hobbit",
            "quote": "'If more of us valued food and cheer and song above hoarded gold, it would be a merrier world.'"
        },
        {
            "author": "The Hobbit",
            "quote": "...there is no knowing what a Dwarf will not dare and do for revenge or the recovery of his own."
        },
        {
            "author": "Unfinished Tales",
            "quote": "...and after plundering and harrying, the Easterlings drew back northwards."
        },
        {
            "author": "Gondor's Steward, Unfinished Tales",
            "quote": "Calimehtar, son of Narmacil II, helped by a revolt in Rhovanion, avenged his father with a great victory over the Easterlings upon Dagorlad..."
        },
        {
            "author": "Unfinished Tales",
            "quote": "...attacks on Gondor from the East were renewed, and Orcs and Easterlings overran Calenardhon and besieged the forts, which would not have long held out."
        },
        {
            "author": "the Spider, Shelob's Lair",
            "quote": "...out of the upper exit from her lair, she moved with a horrible speed, now running on her creaking legs, now making a sudden bound."
        },
        {
            "author": "Bilbo sees spiders, The Hobbit",
            "quote": "'Insect eyes,' he thought, 'not animal eyes, only they are much too big.'"
        },
        {
            "author": "Bilbo in Mirkwood, The Hobbit",
            "quote": "Suddenly he saw, too, that there were spiders huge and horrible sitting in the branches above him..."
        },
        {
            "author": "Ungoliant, Quenta Silmarillion",
            "quote": "...she would into the forgotten south of the world, her offspring abode there and wove their hideous webs."
        },
        {
            "author": "in Mirkwood, The Hobbit",
            "quote": "...the spiders suddenly gave it up, and followed them no more, but went back disappointed to their dark colony."
        },
        {
            "author": "Gandalf about Sauron, The Council of Elrond",
            "quote": "'It was by the devices of Saruman that we drove him from Dol Guldur.'"
        },
        {
            "author": "Gandalf trusts Barliman, The Council of Elrond",
            "quote": "'But fat men who sell ale have many calls to answer; and the power of Sauron is still less than fear makes it.'"
        },
        {
            "author": "Celeborn, Farewell to Lórien",
            "quote": "'And are not the bridges of Osgiliath broken down and all the landings held now by the Enemy?'"
        },
        {
            "author": "Gandalf the Grey, The Council of Elrond",
            "quote": "'For Saruman the White is the greatest of my order.'"
        },
        {
            "author": "Aragorn, Farewell to Lórien",
            "quote": "His own plan, while Gandalf remained with them, had been to go with Boromir, and with his sword help to deliver Gondor."
        },
        {
            "author": "Boromir to Frodo, Farewell to Lórien",
            "quote": "'But if you wish to destroy the armed might of the Dark Lord, then it is folly to go without force into his domain; and folly to throw away.'"
        },
        {
            "author": "Haldir, Farewell to Lórien",
            "quote": "'I have returned from the Northern Fences,' said the Elf, `and I am sent now to be your guide again.'"
        },
        {
            "author": "Galadriel, Farewell to Lórien",
            "quote": "To Legolas, she gave a bow such as the Galadhrim used, longer and stouter than the bows of Mirkwood, and strung with a string of elf-hair."
        },
        {
            "author": "Galadriel, Farewell to Lórien",
            "quote": "`I do not foretell, for all foretelling is now vain: on the one hand lies darkness, and on the other only hope.'"
        },
        {
            "author": "Gimli, Farewell to Lórien",
            "quote": "'Torment in the dark was the danger that I feared, and it did not hold me back.'"
        },
        {
            "author": "the Fellowship, The Great River",
            "quote": "It was dark, but not too dark for the night-eyes of Orcs, and in the star-glimmer they must have offered their cunning foes some mark..."
        },
        {
            "author": "The Great River",
            "quote": "'Seldom in my life has any boat come out of the North, and the Orcs prowl on the east-shore,' said Boromir."
        },
        {
            "author": "Aragorn about Orcs, The Great River",
            "quote": "'...and of late, it is said, they have dared to cross the water and raid the herds and studs of Rohan.'"
        },
        {
            "author": "Sméagol about the dead, The Passage of the Marshes",
            "quote": "'It was a great battle. Tall Men with long swords, and terrible Elves, and Orcses shrieking. They fought on the plain for days and months at the Black Gate.'"
        },
        {
            "author": "Peoples of Middle-earth, Of Dwarves and Men",
            "quote": "No Dwarf would ever mount a horse willingly, nor did any ever harbour animals, not even dogs."
        },
        {
            "author": "Durin's Folk",
            "quote": "But those who fell in Azanulbizar were honoured in memory, and to this day a Dwarf will say proudly of one of his sires: 'He was a burned Dwarf', and that is enough."
        },
        {
            "author": "Dwarves learn Sindar letters, Silmarillion",
            "quote": "By the Naugrim, the Cirth were taken east over the mountains and passed into the knowledge of many peoples."
        },
        {
            "author": "Spears made for Northmen before Smaug came, The Hobbit",
            "quote": "...each had a thrice-forged head and their shafts were inlaid with cunning gold, but they were never delivered or paid for."
        },
        {
            "author": "Gandalf to Thorin and his men, Unfinished Tales",
            "quote": "'...I chose Mr. Baggins. Just let any one say I chose the wrong man or the wrong house, and you can stop at thirteen and have all the bad luck you like, or go back to digging coal.'"
        },
        {
            "author": "Revenge, Unfinished Tales",
            "quote": "'Dwarves take such duties very seriously.'"
        },
        {
            "author": "Gandalf about Dwarven perception, Unfinished Tales",
            "quote": "'...no one can have or make anything 'of value' save them­selves, and that all fine things in other hands must have been got, if not stolen, from the Dwarves at some time...'"
        },
        {
            "author": "The Balrog comes, The Bridge of Khazad-dûm",
            "quote": "But it was not the trolls that had filled the Elf with terror. The ranks of the Orcs had opened, and they crowded away, as if they themselves were afraid."
        },
        {
            "author": "in the chamber of Mazarbul, The Bridge of Khazad-dûm",
            "quote": "How many there were the Company could not count. The affray was sharp, but the Orcs were dismayed by the fierceness of the defence."
        },
        {
            "author": "Arwen about mortality, The Tale of Aragorn and Arwen",
            "quote": "'For if this is indeed, as the Eldar say, the gift of the One to Men, it is bitter to receive.'"
        },
        {
            "author": "the Stewards, The Peoples of Middle-earth",
            "quote": "...were of Númenórean blood hardly less pure than that of the kings, and undoubtedly had some share in the actual blood of Elendil and Anárion."
        },
        {
            "author": "Aragorn, The Tale of Aragorn and Arwen",
            "quote": "...he passed out of the knowledge of Men of the West, and went alone far into the East and deep into the South, exploring the hearts of Men, both evil and good..."
        },
        {
            "author": "Aragorn, The Great River",
            "quote": "'Far away down in the Bay of Belfalas, to which Anduin runs, it is warm and merry, maybe, or would be but for the Enemy.'"
        },
        {
            "author": "Gandalf, The Shadow of the Past",
            "quote": "'Mordor draws all wicked things, and the Dark Power was bending all its will to gather them there.'"
        },
        {
            "author": "Gandalf, The Shadow of the Past",
            "quote": "'And all folk were whispering then of the new Shadow in the South, and its hatred of the West.'"
        },
        {
            "author": "Gandalf, Many Meetings",
            "quote": "'There are Orcs and Trolls, there are Wargs and Werewolves; and there have been and still are many Men, warriors and kings, that walk alive under the Sun, and yet are under his sway.'"
        },
        {
            "author": "Nazgûl, Flight to the Ford",
            "quote": "Swords were naked in their pale hands; helms were on their heads. Their cold eyes glittered, and they called to him with fell voices."
        },
        {
            "author": "The Witch King, The Battle of Pelennor Fields",
            "quote": "...now he was come again, bringing ruin, turning hope to despair, and victory to death."
        },
        {
            "author": "Faramir, The Forbidden Pool",
            "quote": "'As you know, that city was once a strong place, proud and fair, Minas Ithil, the twin sister to our own city.'"
        },
        {
            "author": "Faramir about the Nazgûl, The Forbidden Pool",
            "quote": "'It is said that their lords were men of Númenor who had fallen into dark wickedness; to them the Enemy had given rings of power, and he had devoured them...'"
        },
        {
            "author": "Gandalf about the Ring, The Shadow of the Past",
            "quote": "'Yes, sooner or later - later, if he is strong or well-meaning to begin with, but neither strength nor good purpose will last - sooner or later, the dark power will devour him.'"
        },
        {
            "author": "Faramir, The Siege of Gondor",
            "quote": "'But it is the Black Captain who defeats us. Few will stand and abide even the rumour of his coming. His own folk quail at him, and they would slay themselves at his bidding.'"
        },
        {
            "author": "The Siege of Gondor",
            "quote": "Now silently the host of Rohan moved forward into the field of Gondor, pouring in slowly but steadily, like the rising tide through breaches in the dike that men had thought secure."
        },
        {
            "author": "The Witch King, Battle of the Pelennor Fields",
            "quote": "But it was no brigand or Orc-chieftain that led the assault upon the Lord of Mordor's greatest foe."
        },
        {
            "author": "Farmer Maggot to a Nazgûl, A Shortcut to Mushrooms",
            "quote": "'You'll go back where you belong, double quick. I give you one minute before I call all my dogs.'"
        },
        {
            "author": "Glóin about the messenger from Mordor, The Council of Elrond",
            "quote": "'The Lord Sauron the Great, so he said, wished for our friendship. Rings he would give for it, such as he gave of old.'"
        },
        {
            "author": "Glóin, Dwarven Lord, The Council of Elrond",
            "quote": "'...for we knew already that the power that has re-entered Mordor has not changed, and ever it betrayed us of old.'"
        },
        {
            "author": "Gandalf about Nazgûl, The White Rider",
            "quote": "'Soon their terror will overshadow the last armies of our friends, cutting off the sun.'"
        },
        {
            "author": "Gorbag to Shagrat, The Choices of Master Samwise",
            "quote": "'...if we get a chance, you and me'll slip off and set up somewhere on our own... somewhere where there's good loot nice and handy, and no big bosses.'"
        },
        {
            "author": "Théoden to Saruman, The Voice of Saruman",
            "quote": "'When you hang from a gibbet at your window for the sport of your own crows, I will have peace with you and Orthanc.'"
        },
        {
            "author": "Théoden to Saruman, The Voice of Saruman",
            "quote": "'You hold out your hand to me, and I perceive only a finger of the claw of Mordor. Cruel and cold!'"
        },
        {
            "author": "Saruman about the Rohirrim, The Voice of Saruman",
            "quote": "'...for they have fought many wars, and assailed many who defied them. Yet with some they have afterwards made peace, none the worse for being politic.'"
        },
        {
            "author": "Saruman the White, The Voice of Saruman",
            "quote": "'The friendship of Saruman and the power of Orthanc cannot be lightly thrown aside, whatever grievances, real or fancied, may lie behind.'"
        },
        {
            "author": "Saruman to Éomer, The Voice of Saruman",
            "quote": "'Slay whom your lord names as enemies, and be content. Meddle not in policies which you do not understand.'"
        },
        {
            "author": "Merry to Gimli about Isengard loot, The Voice of Saruman",
            "quote": "'And this is first-rate salted pork. Or I can cut you some rashers of bacon and broil them, if you like.'"
        },
        {
            "author": "Grishnák about Nazgûl, The Uruk-hai",
            "quote": "'You ought to know they are the apple of the Great Eye.'"
        },
        {
            "author": "the Raiders from Moria, The Uruk-hai",
            "quote": "Round them were many smaller Goblins. Pippin supposed that these were the ones from the North."
        },
        {
            "author": "the Raiders from Moria, The Uruk-hai",
            "quote": "'We have come all the way from the Mines to kill and avenge our folk. I wish to kill, and then go back north.'"
        },
        {
            "author": "Orcs about Merry and Pippin, The Uruk-hai",
            "quote": "'What are they wanted for?' asked several voices. 'Why alive? Do they give good sport?'"
        },
        {
            "author": "Legolas to Éomer, The Riders of Rohan",
            "quote": "'You would die before your stroke fell.'"
        },
        {
            "author": "Aragorn to Éomer, The Riders of Rohan",
            "quote": "'There are few among mortal Men who know more of Orcs; and I do not hunt them in this fashion out of choice.'"
        },
        {
            "author": "Éomer, The Riders of Rohan",
            "quote": "'We do not serve the Power of the Black Land far away, but neither are we yet at open war with him.'"
        },
        {
            "author": "Éomer, The Riders of Rohan",
            "quote": "'...we desire only to be free, and to live as we have lived, keeping our own, and serving no foreign lord, good or evil.'"
        },
        {
            "author": "The Hobbit",
            "quote": "Goblins do not usually venture very far from their mountains, unless they are driven out and are looking for new homes, or are marching to war."
        },
        {
            "author": "Orcs of the Misty Mountains, The Hobbit",
            "quote": "But in those days they sometimes used to go on raids, especially to get food or slaves to work for them. Then they often got the Wargs to help and shared the plunder with them."
        },
        {
            "author": "Thranduil to Thorin II, The Hobbit",
            "quote": "'Did you not three times pursue and trouble my people in the forest and rouse the spiders with your riot and clamour?'"
        },
        {
            "author": "Gandalf, The Hobbit",
            "quote": "'Alas! it has come more swiftly than I guessed. The Goblins are upon you! Bolg of the North is coming, O Dáin! whose father you slew in Moria.'"
        },
        {
            "author": "Treebeard",
            "quote": "'Hoom, hm, I have not troubled about the Great Wars,' said Treebeard; 'they mostly concern Elves and Men. That is the business of Wizards: Wizards are always troubled about the future.'"
        },
        {
            "author": "Faramir, The Window On The West",
            "quote": "'...but I do not love the bright sword for its sharpness, nor the arrow for its swiftness, nor the warrior for his glory. I love only that which they defend: the city of the Men of Númenor.'"
        },
        {
            "author": "Frodo, The Stairs of Cirith Ungol",
            "quote": "'Will Faramir get across in time? He guessed it, but did he know the hour? And who can now hold the fords when the King of the Nine Riders comes? And other armies will come.'"
        }
    ]
}