{
  "quotes": [
    {
      "author": "Gandalf the Grey, The Council of Elrond",
      "quote": "'Even the most subtle spiders may leave a weak thread.'"
    },
    {
      "author": "Gandalf the White, The Voice of Saruman",
      "quote": "'Often does hatred hurt itself!'"
    },
    {
      "author": "Gandalf the White, The Palantír",
      "quote": "'The burned hand teaches best. After that advice about fire goes to the heart.'"
    },
    {
      "author": "Gandalf the Grey, The Shadow of the Past",
      "quote": "'All we have to decide is what to do with the time that is given us.'"
    },
    {
      "author": "Gandalf the White to the hobbits, The Grey Havens",
      "quote": "'I will not say do not weep, for not all tears are an evil.'"
    },
    {
      "author": "Aragorn about Sauron, The Passing of the Grey Company",
      "quote": "'He is not so mighty yet that he is above fear; nay, doubt ever gnaws him.'"
    },
    {
      "author": "Gandalf about Sauron, The Last Debate",
      "quote": "'We must march out to meet him at once.'"
    },
    {
      "author": "The Lady of Lórien, The Mirror of Galadriel",
      "quote": "'You saw the Eye of him that holds the Seven and the Nine.'"
    },
    {
      "author": "Glorfindel, The Council of Elrond",
      "quote": "'Yet oft in lies truth is hidden.'"
    },
    {
      "author": "Gimli son of Glóin, The Rings Goes South",
      "quote": "'Faithless is he that says farewell when the road darkens.'"
    },
    {
      "author": "Gimli son of Glóin, The Rings Goes South",
      "quote": "'Yet sworn word may strengthen quaking heart.'"
    },
    {
      "author": "Éomer King of the Mark, The Battle of the Pelennor Fields",
      "quote": "'Hope often deceives... Yet twice blessed is help unlooked for.'"
    },
    {
      "author": "Aragorn, Captain of the Dúnedain, Helm's Deep",
      "quote": "'None knows what the new day shall bring him.'"
    },
    {
      "author": "The Passing of the Grey Company",
      "quote": "'The hasty stroke goes oft astray', said Aragorn."
    },
    {
      "author": "Aragorn, The Passing of the Grey Company",
      "quote": "'Yet deeds will not be less valiant because they are unpraised.'"
    },
    {
      "author": "Éothain, The Riders of Rohan",
      "quote": "'Do we walk in legends or on the green earth in the daylight?'"
    },
    {
      "author": "Aragorn, The Riders of Rohan",
      "quote": "'Good and ill have not changed since yesteryear.'"
    },
    {
      "author": "Aragorn, Flotsam and Jetsam",
      "quote": "'One who cannot cast away a treasure at need is in fetters.'"
    },
    {
      "author": "Damrod the Ranger about Southrons, Of Herbs and Stewed Rabbit",
      "quote": "'The road may pass but they shall not! Not while Faramir is Captain.'"
    },
    {
      "author": "Haradrim's Chieftain, The Battle of the Pelennor Fields",
      "quote": "...displaying his standard, black serpent upon scarlet, he came..."
    },
    {
      "author": "Aragorn's travels, The Council of Elrond",
      "quote": "'...and trodden many plains, even into the far countries of Rhûn and Harad...'"
    },
    {
      "author": "Denethor II with the Palantír, The Pyre of Denethor",
      "quote": "'But against the Power that now arises there is no victory.'"
    },
    {
      "author": "Faramir, Captain, Of Herbs and Stewed Rabbit",
      "quote": "'The praise of the praiseworthy is above all rewards.'"
    },
    {
      "author": "Faramir to Éowyn, The Steward and the King",
      "quote": "'I do not believe any darkness will endure!'"
    },
    {
      "author": "Boromir, The Fellowship of the Ring",
      "quote": "'One does not simply walk into Mordor.'"
    },
    {
      "author": "Frodo Baggins, The Scouring of the Shire",
      "quote": "'It is useless to meet revenge with revenge: it will heal nothing.'"
    },
    {
      "author": "Gollum about Sauron, The Black Gate is Closed",
      "quote": "'And He hated Isildur's city.'"
    },
    {
      "author": "Samwise Gamgee, gardener, The Window On The West",
      "quote": "'Fair speech may hide a foul heart.'"
    },
    {
      "author": "Théoden to Aragorn, Helm's Deep",
      "quote": "'When dawn comes, I will bid men sound Helm's and I will ride forth.'"
    },
    {
      "author": "Goblins, The Hobbit",
      "quote": "'Grip, grab! Pinch, nab! And down down to Goblin-town! You go, my lad!'"
    },
    {
      "author": "The Peoples of Middle-earth",
      "quote": "Orcs and Trolls occupy parts of the now empty Mines of Moria."
    },
    {
      "author": "Steward Denethor II, Minas Tirith",
      "quote": "'Fealty with love, valour with honour, oath-breaking with vengeance.'"
    },
    {
      "author": "The Lays of Beleriand",
      "quote": "...the Orcs went forth to rape and war, and Balrog captains marched before."
    },
    {
      "author": "The Hobbit",
      "quote": "'We like the dark,' said the dwarves. 'Dark for dark business!'"
    },
    {
      "author": "Smaug, The Hobbit",
      "quote": "'I laid low the warriors of old and their like is not in the world today.'"
    },
    {
      "author": "Éomer, The Battle of the Pelennor Fields",
      "quote": "'Death! Ride, ride to ruin and the world's ending!'"
    },
    {
      "author": "'Axes of the Dwarves! The Dwarves are upon you!', Helm's Deep",
      "quote": "'Baruk Khazâd! Khazâd ai-mênu!'"
    },
    {
      "author": "Lord Elrond, The Hobbit",
      "quote": "'This, Gandalf, was Glamdring, Foe-hammer that the king of Gondolin once wore.'"
    },
    {
      "author": "The Battle of the Pelennor Fields",
      "quote": "and the drawing of the scimitars of the Southrons was like a glitter of stars."
    },
    {
      "author": "Aragorn, The Passing of the Grey Company",
      "quote": "'We must press our Enemy, and no longer wait upon him for the move.'"
    },
    {
      "author": "Helm's Deep",
      "quote": "And then, sudden and terrible, the sound of the great horn of Helm rang out."
    },
    {
      "author": "Sauron, Quenta Silmarillion",
      "quote": "His dominion was torment."
    },
    {
      "author": "Boromir of Gondor, The Council of Elrond",
      "quote": "'Valour needs first strength and then a weapon.'"
    },
    {
      "author": "the Great Ram, The Siege of Gondor",
      "quote": "Grond they named it, in memory of the Hammer of the Underworld of old."
    },
    {
      "author": "Gandalf the White, Unfinished Tales",
      "quote": "'Dwarves understand devotion to friends and gratitude to those who help them.'"
    },
    {
      "author": "Thorin Oakenshield about his quest, Unfinished Tales",
      "quote": "'For I am serious also. Deadly serious, and my heart is hot within me.'"
    },
    {
      "author": "Steward Denethor II, The Siege of Gondor",
      "quote": "'The West has failed.'"
    },
    {
      "author": "Gandalf the White, Unfinished Tales",
      "quote": "'A small oversight; but it proved fatal. Small oversights often do.'"
    },
    {
      "author": "the Witch-king, The Hunt for the Ring",
      "quote": "But the power of the White Ring he would not defy, nor enter yet into Lórien."
    },
    {
      "author": "Queen Erendis of Númenor, Unfinished Tales",
      "quote": "'We also are daughters of the great, and we have wills and courage of our own.'"
    },
    {
      "author": "Beregond, Citadel Guard, Minas Tirith",
      "quote": "'Here, the hammer-stroke will fall hardest.'"
    },
    {
      "author": "Akallabêth - The Downfall of Númenor",
      "quote": "...the Elf-friends... haven was Pelargir above the mouths of Anduin the Great."
    },
    {
      "author": "Sauron's forces are cast out, Unfinished Tales",
      "quote": "Eriador was cleared of the enemy, but lay largely in ruins."
    },
    {
      "author": "Legolas about Imrahil, The Last Debate",
      "quote": "...for he saw that here indeed was one who had Elven-blood in his veins."
    },
    {
      "author": "Isildur to his son, Unfinished Tales",
      "quote": "'Forgive me, and my pride that has brought you to this doom.'"
    },
    {
      "author": "Many Partings",
      "quote": "The Dunlendings fled and hid themselves, for they were afraid of Elvish Folk."
    },
    {
      "author": "Treebeard about Saruman, Many Partings",
      "quote": "'He always was hasty. That was his ruin.'"
    },
    {
      "author": "Isildur's last battle, Unfinished Tales",
      "quote": "The Orcs might pay five to one in this exchange, but it was too cheap."
    },
    {
      "author": "about Elendil, Silmarillion",
      "quote": "...his chief city was at Annúminas beside the water of Lake Nenuial."
    },
    {
      "author": "Of the Rings of Power and the Third Age",
      "quote": "Minas Anor endured, and it was named anew Minas Tirith, the Tower of Guard."
    },
    {
      "author": "Glóin, Dwarven Lord, to Frodo, Many Meetings",
      "quote": "'Only in mining and building have we surpassed the old days.'"
    },
    {
      "author": "about Thengel, The House of Eorl",
      "quote": "But he proved a good and wise king."
    },
    {
      "author": "Shagrat, Orc commander, The Tower of Cirith Ungol",
      "quote": "'You won't go again, you say? Curse you, Snaga, you little maggot!'"
    },
    {
      "author": "Shagrat, Orc commander, The Tower of Cirith Ungol",
      "quote": "'Come here, and I'll squeeze your eyes out, like I did to Radbug just now.'"
    },
    {
      "author": "to Éomer, Helm's Deep",
      "quote": "'Come!' said Aragorn. 'This is the hour when we draw swords together!'"
    },
    {
      "author": "Gamling, Commander of Rohan, Helm's Deep",
      "quote": "'The Orcs are in the Deep!' he cried. 'Helm! Helm! Forth Helmingas.'"
    },
    {
      "author": "The King of the Golden Hall",
      "quote": "'I am the doorward of Théoden,' he said. Háma is my name.'"
    },
    {
      "author": "The Uruk-hai",
      "quote": "'We are the fighting Uruk-hai! We slew the great warrior.'"
    },
    {
      "author": "The Ride of Eorl, Unfinished Tales",
      "quote": "'The Lady of the Golden Wood is on our side, it seems,' said Borondir."
    },
    {
      "author": "the Captain-General of Gondor, The Departure of Boromir",
      "quote": "'I tried to take the Ring from Frodo,' he said. 'I am sorry. I have paid.'"
    },
    {
      "author": "The Great River",
      "quote": "'Yrch!' said Legolas, falling into his own tongue..."
    },
    {
      "author": "the War of the Dwarves and Orcs, Durin's Folk",
      "quote": "Both sides were pitiless, and there was death and cruel deeds...."
    },
    {
      "author": "Azog of Moria to Náin the Dwarf, Durin's Folk",
      "quote": "'What? Yet another beggar at my doors? Must I brand you too?'"
    },
    {
      "author": "The Black Gate Opens",
      "quote": "Down from the hills on either side of the Morannon poured Orcs innumerable."
    },
    {
      "author": "Samwise Gamgee, gardener, The Choices of Master Samwise",
      "quote": "'Don't trust your head, Samwise, it is not the best part of you.'"
    },
    {
      "author": "The White Rider",
      "quote": "'I am Gandalf, Gandalf the White, but Black is mightier still.'"
    },
    {
      "author": "the Fellowship's flight, The Bridge of Khazad-dûm",
      "quote": "They did not halt until they were out of bowshot from the walls."
    },
    {
      "author": "The Breaking of the Fellowship",
      "quote": "From the havens of Harad, ships of war put out to sea."
    },
    {
      "author": "The Breaking of the Fellowship",
      "quote": "All the power of the Dark Lord was in motion."
    },
    {
      "author": "The Breaking of the Fellowship",
      "quote": "There was an eye in the Dark Tower that did not sleep."
    },
    {
      "author": "Chieftain of the Drúedain, The Ride of the Rohirrim",
      "quote": "'Kill gorgûn! Kill orc-folk! No other words please Wild Men' answered Ghân."
    },
    {
      "author": "The Ride of the Rohirrim",
      "quote": "'Need brooks no delay, yet late is better than never', said Éomer."
    },
    {
      "author": "Orc-driver to the disguised Sam and Frodo, The Land of Shadow",
      "quote": "'Where there's a whip there's a will, my slugs.'"
    },
    {
      "author": "Samwise Gamgee, Mount Doom",
      "quote": "His will was set, and only death would break it."
    },
    {
      "author": "Aragorn to those who fear to assault Mordor, The Black Gate Opens",
      "quote": "'...and hold Cair Andros to the last in defence of Gondor and Rohan!'"
    },
    {
      "author": "Saruman's ruffians, The Scouring of the Shire",
      "quote": "...the Hobbits were obliged to shoot many of them or hew them with axes."
    },
    {
      "author": "Dernhelm, The Muster of Rohan",
      "quote": "...it was the face of one without hope who goes in search of death."
    },
    {
      "author": "Éowyn Shieldmaiden, The Battle of the Pelennor Fields",
      "quote": "Her eyes grey as the sea were hard and fell..."
    },
    {
      "author": "Gimli, The King of the Golden Hall",
      "quote": "'Men need many words before deeds. My axe is restless in my hands.'"
    },
    {
      "author": "Haradrim's Chieftain, The Battle of the Pelennor Fields",
      "quote": "Then he was filled with a red wrath and shouted aloud..."
    },
    {
      "author": "Legolas to Treebeard about Gimli, The Voice of Saruman",
      "quote": "'His axe is not for trees, but for orc necks...'"
    },
    {
      "author": "Merry, The Uruk-hai",
      "quote": "'Lembas does put heart into you!'"
    },
    {
      "author": "about Haradrim, War of the Ring",
      "quote": "...grim folk, and not easily daunted by shade or blade."
    },
    {
      "author": "Unfinished Tales",
      "quote": "...the dreadful Orcish wolfriders, feared by horses."
    },
    {
      "author": "Barliman on evil men in Bree, Homeward Bound",
      "quote": "'And that was after we showed them the gates and pushed them out...'"
    },
    {
      "author": "Barliman about Bree, Homeward Bound",
      "quote": "'Why, we had a real set-to, and there were some folk killed, killed dead!'"
    },
    {
      "author": "Théoden about Erkenbrand, Helm's Deep",
      "quote": "'He was a mighty man. In him lived again the valour of Helm the Hammerhand.'"
    },
    {
      "author": "Gandalf the Grey, The Council of Elrond",
      "quote": "'...things are now moving which will require the union of all our strength.'"
    },
    {
      "author": "Legolas, The Two Towers",
      "quote": "'They are taking the Hobbits to Isengard!'"
    },
    {
      "author": "Gandalf, The Bridge of Khazad-dûm",
      "quote": "'So ended the attempt to retake Moria!'"
    },
    {
      "author": "Gandalf, The Bridge of Khazad-dûm",
      "quote": "'Let us go, before the troll returns!'"
    },
    {
      "author": "the Balrog, The Bridge of Khazad-dûm",
      "quote": "...and a power and terror seemed to be in it and to go before it."
    },
    {
      "author": "Gandalf, Of the Rings of Power and the Third Age",
      "quote": "'It is Sauron himself who has taken shape again and now grows apace.'"
    },
    {
      "author": "Aragorn, Strider",
      "quote": "'Well, I have rather a rascally look, have I not?'"
    },
    {
      "author": "Aragorn, The Departure of Boromir",
      "quote": "'The Orcs in the service of the Barad-dûr use the sign of the Red Eye.'"
    },
    {
      "author": "Frodo Baggins, Of Herbs and Stewed Rabbit",
      "quote": "'...I am a friend of all enemies of the One Enemy.'"
    },
    {
      "author": "Faramir, The Window on the West",
      "quote": "'It is long since we had any hope.'"
    },
    {
      "author": "Faramir, The Window on the West",
      "quote": "'Men now fear and misdoubt the Elves...'"
    },
    {
      "author": "Gandalf the White, Minas Tirith",
      "quote": "'Hail, Lord and Steward of Minas Tirith, Denethor son of Ecthelion!'"
    },
    {
      "author": "Steward Denethor II, Minas Tirith",
      "quote": "'Pride would be folly that disdained help and counsel at need.'"
    },
    {
      "author": "The Battle of the Pelennor Fields",
      "quote": "The axes hewed Forlong as he fought alone and unhorsed."
    },
    {
      "author": "the Steward of Gondor, The Pyre of Denethor",
      "quote": "'All the East is moving.'"
    },
    {
      "author": "Gandalf the White, Minas Tirith",
      "quote": "'Courage will now be your best defence against the storm that is at hand...'"
    },
    {
      "author": "The House of Eorl: The Kings of the Mark",
      "quote": "Orcs began to raid in the eastern regions and slay or steal horses."
    },
    {
      "author": "Aragorn, The Last Debate",
      "quote": "'Four thousands I sent marching from Pelargir through Lossarnach two days ago.'"
    },
    {
      "author": "The Ride of the Rohirrim",
      "quote": "Orcs were roving in the hills and woods along the roadside."
    },
    {
      "author": "Gandalf the White, Minas Tirith",
      "quote": "'The beacons of Gondor are alight, calling for aid. War is kindled.'"
    },
    {
      "author": "Nazgûl's Morgul blades, A Knife in the Dark",
      "quote": "...both the knife and the hand that held it glowed with a pale light."
    },
    {
      "author": "Warg Riders, The Hobbit",
      "quote": "Ere long the vanguard swirled round the spur's end and came rushing into Dale."
    },
    {
      "author": "the Silvan Elves, The Hobbit",
      "quote": "Behind the arrows a thousand of their spearmen leapt down and charged."
    },
    {
      "author": "Bilbo's goodbye to the Dwarves, The Hobbit",
      "quote": "'May your beard never grow thin!'"
    },
    {
      "author": "Pippin about fighting the Shadow, Minas Tirith",
      "quote": "'We may stand, if only on one leg, or at least be left still upon our knees.'"
    },
    {
      "author": "Steward Denethor II, The Siege of Gondor",
      "quote": "'And where will other men look for help, if Gondor falls?'"
    },
    {
      "author": "Gandalf, The Siege of Gondor",
      "quote": "'There are evil days ahead.'"
    },
    {
      "author": "Denethor about Sauron, The Siege of Gondor",
      "quote": "'He uses others as his weapons. So do all great lords, if they are wise...'"
    },
    {
      "author": "the Silvan Elves, The Hobbit",
      "quote": "Though their magic was strong, even in those days they were wary."
    },
    {
      "author": "the Lord of the Eagles, The Hobbit",
      "quote": "'I hear wolves voices! Are the Goblin's at mischief in the woods?'"
    },
    {
      "author": "The Hobbit",
      "quote": "...the Goblins had spread in secret after the battle of the Mines of Moria."
    },
    {
      "author": "Gandalf about Sauron, The Hobbit",
      "quote": "'He is an enemy quite beyond the powers of all the Dwarves put together...'"
    },
    {
      "author": "Unfinished Tales; The Palantíri",
      "quote": "It was Sauron who made them sinister, and instruments of domination and deceit."
    },
    {
      "author": "Gildor Inglorion of the House of Finrod, Three is Company",
      "quote": "'Courage is found in unlikely places.'"
    },
    {
      "author": "Dúnedain, At the Sign of the Prancing Pony",
      "quote": "The Bree-folk called them Rangers, and knew nothing of their origin."
    },
    {
      "author": "Glorfindel about the Witch-king, Gondor and the Heirs of Anárion",
      "quote": "'Far off yet is his doom, and not by the hand of man will he fall.'"
    },
    {
      "author": "Denethor and Aragorn, Gondor and the Heirs of Anárion",
      "quote": "Indeed he was as like to Thorongil as to one of nearest kin..."
    },
    {
      "author": "Elrond to Aragorn, The Tale of Aragorn and Arwen",
      "quote": "'Here is the ring of Barahir,' he said, 'the token of our kinship from afar.'"
    },
    {
      "author": "Arwen, The Tale of Aragorn and Arwen",
      "quote": "'I have dwelt for a time in the land of my mother's kin, in far Lothlórien.'"
    },
    {
      "author": "Gilraen, his mother, The Tale of Aragorn and Arwen",
      "quote": "'I gave Hope to the Dúnedain, I have kept no hope for myself.'"
    },
    {
      "author": "The Languages and Peoples of the Third Age",
      "quote": "Trolls therefore took such language as they could master from the Orcs."
    },
    {
      "author": "The Dwarves, The Hobbit",
      "quote": "For some Elves tease them and laugh at them, and most of all at their beards."
    },
    {
      "author": "Elrond about Orcrist, The Hobbit",
      "quote": "'May it soon cleave Goblins once again!'"
    },
    {
      "author": "The Hobbit",
      "quote": "Now it seemed that a great Goblin-raid had been planned for that very night."
    },
    {
      "author": "Bard of Lake Town, The Hobbit",
      "quote": "Now he shot with a great yew bow, till all his arrows but one were spent."
    },
    {
      "author": "about the Lake-men and Silvans, The Hobbit",
      "quote": "'They have come!' called Balin. 'And their camp is very great.'"
    },
    {
      "author": "Thranduil, The Hobbit",
      "quote": "'Long will I tarry, ere I begin this war for gold.'"
    },
    {
      "author": "Silvans charge, The Hobbit",
      "quote": "The yells were deafening. The rocks were stained black with goblin blood."
    },
    {
      "author": "Dwarves of the Iron Hills, The Hobbit",
      "quote": "...and beside them came the men of the Lake with long swords."
    },
    {
      "author": "Unfinished Tales",
      "quote": "...and after plundering and harrying, the Easterlings drew back northwards."
    },
    {
      "author": "Bilbo sees spiders, The Hobbit",
      "quote": "'Insect eyes,' he thought, 'not animal eyes, only they are much too big.'"
    },
    {
      "author": "Gandalf about Sauron, The Council of Elrond",
      "quote": "'It was by the devices of Saruman that we drove him from Dol Guldur.'"
    },
    {
      "author": "Gandalf the Grey, The Council of Elrond",
      "quote": "'For Saruman the White is the greatest of my order.'"
    },
    {
      "author": "Revenge, Unfinished Tales",
      "quote": "'Dwarves take such duties very seriously.'"
    },
    {
      "author": "Grishnák about Nazgûl, The Uruk-hai",
      "quote": "'You ought to know they are the apple of the Great Eye.'"
    },
    {
      "author": "Legolas to Éomer, The Riders of Rohan",
      "quote": "'You would die before your stroke fell.'"
    }
  ]
}